[
  {
    "shortName": "ICMERR",
    "name": "International Conference on Mechanical Engineering and Robotics Research",
    "start": "2025-01-15",
    "end": "2025-01-17",
    "deadline": "2024-10-25",
    "city": "Barcelona",
    "country": "Spain",
    "link": "http://www.icmerr.com",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/TagpgwerivEqfUvu5",
    "note": "the 9th International Conference on Mechanical Engineering and Robotics Research (ICMERR) will be held in Barcelona, Spain from January 15 to 17, 2025. ICMERR aims to be one of the leading international conferences for presenting novel and fundamental advances in the fields of mechanical engineering and robotics. The conference seeks to bring together experts from academia, industry, and government to promote interdisciplinary collaborations and facilitate the development of innovative solutions to real-world problems. ICMERR also serves to foster communication among researchers and practitioners working in a wide variety of scientific areas with a common interest in improving mechanical engineering and robotics techniques."
  },
  {
    "shortName": "SII",
    "name": "International Conference on Gender and Technology",
    "start": "2025-01-16",
    "end": "2025-01-19",
    "deadline": "2024-08-30",
    "city": "Kerala",
    "country": "India",
    "link": "https://www.amrita.edu/events/gender-technology-conference-2025",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/waC6ZW7QMoRMGqQT7",
    "note": "The International Conference on Gender and Technology 2025 invites submissions for papers related to the intersection of gender with emerging technologies, e.g. Blockchain, AI, VR/mixed reality, IoT, and robotics, and how these have been enablers across the the following Thematic Areas"
  },
  {
    "shortName": "SII",
    "name": "IEEE/SICE International Symposium on System Integration",
    "start": "2025-01-21",
    "end": "2025-01-24",
    "deadline": "2024-09-30",
    "city": "Munich",
    "country": "Germany",
    "link": "https://www.sice-si.org/SII2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/dbFNcmNf1F6THNhC6",
    "note": "The 2025 IEEE/SICE International Symposium on System Integrations (SII 2025) will be the 17th symposium on system integration. System integration is one of the key technologies, and integrating hardware and software is especially important to solve the industrial or social system problems in the new century. This symposium focuses on the latest research and industrial application of system integration and discusses the approach method to improve the effectiveness of system integration."
  },
  {
    "shortName": "ICARA",
    "name": "11th International Conference on Automation, Robotics, and Applications",
    "start": "2025-02-12",
    "end": "2025-02-14",
    "deadline": "2024-09-25",
    "city": "Zagreb",
    "country": "Croatia",
    "link": "http://www.icara.us/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/B2Snooa944Tou5xD7",
    "note": "In recent years, the field of Automation and Robotics has experienced significant advancements, revolutionizing industries and shaping the future of technology. Automation involves the use of technology to perform tasks with minimal human intervention, while Robotics focuses on the design and development of intelligent machines capable of interacting with the physical world. The rapid development of automation and robotics has been fueled by advancements in key technologies such as sensors, actuators, control systems, machine learning, computer vision, and human-robot interaction. These technologies have enabled the creation of autonomous systems that can perceive their environment, make decisions, and execute tasks efficiently."
  },
  {
    "shortName": "ICMRE",
    "name": "11th International Conference on Mechatronics and Robotics Engineering",
    "start": "2025-02-24",
    "end": "2025-02-26",
    "deadline": "2025-09-30",
    "city": "Lille",
    "country": "France",
    "link": "http://www.icmre.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/V2TjeR4gBrdCUhSq8",
    "note": "2025 the 11th International Conference on Mechatronics and Robotics Engineering (ICMRE) is set to unfold in Lille, France, from February 24-26, 2025. Established as a distinguished international academic platform, ICMRE has been bringing together researchers, engineers, academicians, and industry professionals since its inauguration in Kuala Lumpur, Malaysia, in 2015. Following events were hosted in Nice, France (2016), Paris, France (2017 and 2018), and the University of Valenciennes, France. More recently, the conference took place in Rome, Italy (2019), and Barcelona, Spain (2020). From 2021 to 2023, ICMRE shifted to an online format, in collaboration with the Southern University of Science and Technology, China. ICMRE 2025 will be sponsored by Polytech Lille-CRIStAL, University of Lille, France."
  },
  {
    "shortName": "ICICIP",
    "name": "International Conference on Intelligent Control and Information Processing",
    "start": "2025-02-06",
    "end": "2025-02-11",
    "deadline": "2024-11-15",
    "city": "Muscat",
    "country": "Oman",
    "link": "https://conference.cs.cityu.edu.hk/icicip/",
    "type": "Conference",
    "addressLink": "",
    "note": "The 13th International Conference on Intelligent Control and Information Processing (ICICIP2025) will be held in Muscat, Oman, February 6-11, 2025, following the successes of previous events. As the capital of Oman, Muscat is Oman's largest city with a population of over four million people and numerous tourist attractions. ICICIP2025 aims to provide a high-level international forum for scientists, engineers, and educators to present the state of the art of research and applications in related fields. The conference will feature plenary speeches given by world-renowned scholars, regular sessions with broad coverage, special sessions focusing on popular topics, and post-conference workshops/tutorials in the region."
  },
  {
    "shortName": "ICETA",
    "name": "IEEE International Conference on Emerging Technologies and Application",
    "start": "2025-02-21",
    "end": "2025-02-23",
    "deadline": "",
    "city": "Gwalior",
    "country": "India",
    "link": "https://iceta2025.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/4ztH2LATjDeDkXQt7",
    "note": "The conference aims to promote research and networking among academic institutes, R&D institutions, industries and other organisations. The conference is a major step towards the continuous efforts of the IEEE Madhya Pradesh Section towards the promotion of technical acumen and networking within the region. The conference invites papers from authors worldwide, while geographically all editions of the conference would be held within the Madhya Pradesh region"
  },
  {
    "shortName": "ICCAE",
    "name": "17th International Conference on Computer and Automation Engineering",
    "start": "2025-03-20",
    "end": "2025-03-22",
    "deadline": "2025-01-31",
    "city": "Perth",
    "country": "Australia",
    "link": "http://www.iccae.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/uKiZdsrktj3xWP3aA",
    "note": ""
  },
  {
    "shortName": "ICAACE",
    "name": "8th International Conference on Advanced Algorithms and Control Engineering",
    "start": "2025-03-21",
    "end": "2025-03-23",
    "deadline": "",
    "city": "Shanghai",
    "country": "China",
    "link": "http://www.icaace.net/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/nURjWTWnquuN5Ku46",
    "note": ""
  },
  {
    "shortName": "HRI",
    "name": "ACM/IEEE International Conference on Human-Robot Interaction",
    "start": "2025-03-04",
    "end": "2025-03-06",
    "deadline": "2024-10-18",
    "city": "Melbourne",
    "country": "Australia",
    "link": "https://humanrobotinteraction.org/2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/CLHqNRCiybSaYFdDA",
    "note": "We are excited to announce the 20th Annual ACM/IEEE International Conference on Human Robot Interaction (HRI). HRI is the annual conference for basic and applied HRI research, where researchers from across the world present their best work to exchange ideas about theory, technology, data, and science furthering the state-of-the-art in the field."
  },
  {
    "shortName": "ERF",
    "name": "European Robotics Forum",
    "start": "2025-03-25",
    "end": "2025-03-27",
    "deadline": "2024-11-01",
    "city": "Stuttgart",
    "country": "Germany",
    "link": "https://erf2025.eu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/YBkSPh9fq3MkFU8r5",
    "note": "Participants will have the opportunity to explore industrial institutions as well as Fraunhofer Institutes, the University of Stuttgart, Cyber Valley, and the Max Planck Institute for Intelligent Systems. These visits will offer valuable insights into pioneering research and market-ready applications. Stuttgart's automotive heritage has fostered an exceptional ecosystem of automation suppliers. The convergence of academia, research institutions, and industry presents a unique opportunity for collaboration and the exploration of innovative solutions. With over 1,000 industrial projects each year, the Fraunhofer Institute for Manufacturing Engineering and Automation IPA serves as a perfect base for attracting sponsors and delegates beyond euRobotics. We anticipate a significant increase in both sponsorship support and the number of delegates. We are curating a series of site visits to renowned robotic end-users and technology providers."
  },
  {
    "shortName": "ICMRACC",
    "name": "IEEE 1st International Conference on Materials, Robotics & Automation, Computer and Control",
    "start": "2025-03-14",
    "end": "2025-03-16",
    "deadline": "",
    "city": "Kannur",
    "country": "India",
    "link": "",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "CIES",
    "name": "IEEE Symposium on Computational Intelligence in in Engineering/Cyber Physical Systems",
    "start": "2025-03-17",
    "end": "2025-03-20",
    "deadline": "2025-09-17",
    "city": "Trondheim",
    "country": "Norway",
    "link": "https://ieee-ssci.org/?ui=ci-in-engineering-cyber-physical-systems",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/3W7DnSoM811cRKt5A",
    "note": "This symposium aims to serve as a leading forum for researchers, technologists, and industry experts to exchange ideas, share advancements, and shape the future of this interdisciplinary field. Indeed, the fusion of CI with engineering and CPS is revolutionizing the way we interact with our physical world, making systems smarter, more efficient, and more adaptive. The application of CI and machine learning (ML) in these domains is not just enhancing existing technologies but is also paving the way for novel paradigms in design, operation, and services."
  },
  {
    "shortName": "ICARSC",
    "name": "IEEE International Conference on Autonomous Robot Systems and Competitions",
    "start": "2025-04-02",
    "end": "2025-04-03",
    "deadline": "2025-01-26",
    "city": "Funchal",
    "country": "Portugal",
    "link": "http://icarsc.pt/2025",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/f9oPutQtviadUjmQ9",
    "note": "he conference will take place at the University of Madeira at Madeira Island on April 2nd and 3rd, 2025, in conjunction with the Portuguese Robotics Open, a RoboCup-sponsored Local Event with several other associated competitions. Its scope encompasses, but is not limited to, the fields of Artificial Intelligence, Robotics and Education. The conference is planned for physical participation."
  },
  {
    "shortName": "AIRC",
    "name": "6th International Conference on Artificial Intelligence, Robotics and Control",
    "start": "2025-04-09",
    "end": "2025-04-11",
    "deadline": "2025-02-25",
    "city": "Savannah, GA",
    "country": "USA",
    "link": "http://www.airc.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Arp2Us77yE9iiEBY7",
    "note": "AIRC 2025 aims to serve as a vibrant forum for scholars, researchers, and engineers to present groundbreaking research, share innovative ideas, and foster meaningful collaborations. We cordially encourage you to contribute your latest research to AIRC 2025. This is more than just an academic conference; it's an opportunity to engage with leading experts, strengthen interdisciplinary collaborations."
  },
  {
    "shortName": "ICCRT",
    "name": "3rd International Conference on Control and Robot Technology",
    "start": "2025-04-16",
    "end": "2025-04-18",
    "deadline": "2025-02-20",
    "city": "Singapore",
    "country": "Singapore",
    "link": "http://www.iccrt.org/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/1NMDcBiFprfFkYVi9",
    "note": "The main theme of the conference is to address and deliberate on the latest technical status and recent trends in the research and applications of machine learning technologies. The purpose of the conference is to provide an opportunity for the scientists, engineers, industrialists, scholars and other professionals from all over the world to interact and exchange their new ideas and research outcomes in related fields and develop possible chances for future collaboration. The conference is also aimed at motivating the next generation of researchers to promote their interests in control and Robot technology."
  },
  {
    "shortName": "CAIF",
    "name": "OkIP International Conference on Artificial Intelligence Frontiers ",
    "start": "2025-04-01",
    "end": "2025-04-03",
    "deadline": "2025-01-19",
    "city": "Oklahoma",
    "country": "USA",
    "link": "https://eventutor.com/e/CAIF002",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/drU7wxe2RgpmNMub9",
    "note": "The conference aims to unite scholars from different disciplinary backgrounds to emphasize disseminating ongoing research and development. Proposals are solicited describing original works in the fields and related technologies. This event will include a peer-reviewed program of technical, industrial, and poster sessions."
  },
  {
    "shortName": "ICCAR",
    "name": "11th International Conference on Control, Automation and Robotics",
    "start": "2025-04-18",
    "end": "2025-04-20",
    "deadline": "",
    "city": "Kyoto",
    "country": "Japan",
    "link": "http://www.iccar.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Jd87EtEy58E15cwL9",
    "note": ""
  },
  {
    "shortName": "SIMPAR",
    "name": "International Conference on Simulation, Modeling, and Programming for Autonomous Robots",
    "start": "2025-04-14",
    "end": "2025-04-18",
    "deadline": "2025-01-15",
    "city": "Palermo",
    "country": "Italy",
    "link": "https://www.simpar2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/m6yjCZ3Gf5RtqcS26",
    "note": "SIMPAR brings together researchers and engineers from academia and industry to identify and solve critical issues in software development for autonomous robots and to boost a smooth shifting of results from simulated to real-world applications."
  },
  {
    "shortName": "RiE",
    "name": "Robotics in Education",
    "start": "2025-04-23",
    "end": "2025-04-25",
    "deadline": "2025-01-31",
    "city": "Thessaloniki",
    "country": "Greece",
    "link": "https://rie.science/2025/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/bdPqmAEQTLkqirGd9",
    "note": "The 16th International Conference on Robotics in Education (RiE) aims at bringing academics, researchers, teachers, practicing engineers and industry experts from all over the world onto a common platform.The 2025 Edition of RiE will be held live in the Thessaloniki, Greece. We encourage you to submit and present new trends, practical experiences, innovations and advances in the area of Robotics in Education."
  },
  {
    "shortName": "RoboSoft",
    "name": "IEEE-RAS International Conference on Soft Robotics",
    "start": "2025-04-23",
    "end": "2025-04-26",
    "deadline": "2024-10-31",
    "city": "Lausanne",
    "country": "Switzerland",
    "link": "https://robosoft2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/rQUg32Vvr2xZ2M16A",
    "note": "The theme for the 8th IEEE-RAS International Conference on Soft Robotics (RoboSoft 2025) centers on 'Interdisciplinarity and Widening Horizons', emphasizing the collaborative spirit and innovative cross-disciplinary approaches driving the future of soft robotics. Join us for an inspiring gathering of researchers, industry experts and students as we explore the cutting-edge advancements and share insights across various fields. Together, we’ll expand our horizons and pave the way for the next generation of soft robotics technologies. The conference will include keynote talks, demonstrations, discussions, forums, art displays and more."
  },
  {
    "shortName": "SEAMS",
    "name": "International Conference on Software Engineering for Adaptive and Self-Managing Systems",
    "start": "2025-04-26",
    "end": "2025-05-04",
    "deadline": "2024-10-01",
    "city": "Ottawa",
    "country": "Canada",
    "link": "https://conf.researchr.org/home/seams-2025",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/6oKWwxrWWLoqZUWz7",
    "note": "SEAMS is a CORE-A ranked conference that applies software engineering methods, techniques, processes, and tools to support the construction of safe, performant, and cost-effective self-adaptive and autonomous systems that provide self-* properties like self-configuration, self-healing, self-optimization, and self-protection. The objective of SEAMS is to bring together researchers and practitioners from academia, industry, and government to investigate, discuss, examine, and advance the fundamental principles, state of the art, and the solutions addressing critical challenges of engineering self-adaptive and self-managing systems."
  },
  {
    "shortName": "CROS",
    "name": "Brazilian Conference on Robotics",
    "start": "2025-04-28",
    "end": "2025-05-30",
    "deadline": "2024-01-13",
    "city": "Belo Horizonte",
    "country": "Brazil",
    "link": "https://sbrobotica.org/cros2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/YfpvjUrq46joAgCC7",
    "note": "The 1st Conference on Robotics (CROS) is a forum the Brazilian Robotics Society (SBRobotica) promotes. It aims to promote a scientific meeting in the field of robotics. The event will feature plenary talks from recognized experts in the field of robotics and technical sessions with oral and poster presentations of full papers that have been submitted and accepted for the conference. This inaugural edition of CROS will take place in the beautiful city of Belo Horizonte, Minas Gerais, Brazil, from April 28th to 30th, 2025."
  },
  {
    "shortName": "ICCRE",
    "name": "10th International Conference on Control and Robotics Engineering",
    "start": "2025-05-09",
    "end": "2025-05-11",
    "deadline": "2025-01-20",
    "city": "Nagoya",
    "country": "Japan",
    "link": "http://www.iccre.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/XZ2EGWr3sNdCsGa17",
    "note": ""
  },
  {
    "shortName": "ICORR",
    "name": "International Conference On Rehabilitation Robotics",
    "start": "2025-05-12",
    "end": "2025-05-17",
    "deadline": "2024-12-06",
    "city": "Chicago",
    "country": "USA",
    "link": "http://rehabweek.org/icorr",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/4tCtbDtfjw9qbPbi6",
    "note": ""
  },
  {
    "shortName": "ICCCR",
    "name": "5th International Conference on Computer, Control and Robotics",
    "start": "2025-05-16",
    "end": "2025-05-18",
    "deadline": "2025-03-30",
    "city": "Hangzhou",
    "country": "China",
    "link": "http://www.icccr.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2a5yRbvY5XEFtr3c9",
    "note": ""
  },
  {
    "shortName": "ICICR",
    "name": "2nd International Conference on Intelligent Computing and Robotics",
    "start": "2025-05-16",
    "end": "2025-05-18",
    "deadline": "2025-02-28",
    "city": "Dalian",
    "country": "China",
    "link": "http://www.icrconf.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Jd25oUSNhzrnmq7E8",
    "note": ""
  },
  {
    "shortName": "IAV",
    "name": "IFAC Symposium on Intelligent Autonomous Vehicles",
    "start": "2025-05-07",
    "end": "2025-05-09",
    "deadline": "2025-01-15",
    "city": "Phoenix, Arizona",
    "country": "USA",
    "link": "https://events.engineering.asu.edu/iav-2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/L3J7Xzq5M9TRhrQFA",
    "note": "The IAV Symposium will feature a variety of engaging events, including technical sessions, invited presentations, workshops, panel discussions, plenary talks, industry demonstrations, and educational activities."
  },
  {
    "shortName": "ICRA",
    "name": "IEEE International Conference on Robotics and Automation",
    "start": "2025-05-19",
    "end": "2025-05-23",
    "deadline": "2024-09-15",
    "city": "Atlanta",
    "country": "USA",
    "link": "https://2025.ieee-icra.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2bf9M5y4vR6Js5TNA",
    "note": "The flagship conference of the IEEE Robotics and Automation Society (RAS), ICRA brings together the world’s top researchers and industry leaders to share ideas, exchange knowledge, and advance the field of robotics for the benefit of humanity. With a rapidly changing landscape, it has never been more important to attend this leading industry event."
  },
  {
    "shortName": "EECR",
    "name": "International Conference on Electrical Engineering, Control and Robotics",
    "start": "2025-04-25",
    "end": "2025-04-27",
    "deadline": "2024-12-01",
    "city": "Changzhou",
    "country": "China",
    "link": "http://eecr.org/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/7cDp3LLkJoSSKeAq9",
    "note": "2025 11th International Conference on Electrical Engineering, Control and Robotics (EECR 2025) will be held in Changzhou, China during April 18-20, 2025, with the supports of Hohai University, China. The goal of this conference is to foster pure and applied researches in recognition of academic and industry, and to encourage interdisciplinary and international collaboration for the participants."
  },
  {
    "shortName": "MRAI",
    "name": "International Conference on Mechatronics, Robotics, and Artificial Intelligence",
    "start": "2025-04-25",
    "end": "2025-04-27",
    "deadline": "2025-03-28",
    "city": "Jinan",
    "country": "China",
    "link": "https://www.icmrai.org/",
    "type": "Conference",
    "addressLink": "https://maps.google.com/?q=Jinan,+China",
    "note": "MRAI 2025 focuses on Mechatronics, Robotics, and Artificial Intelligence, bringing together experts from these fields for cross-disciplinary discussions. It covers topics like mobile robotics, intelligent control, and AI applications, with papers published by IEEE and indexed in IEEE Xplore."
  },
  {
    "shortName": "AISTANDARD",
    "name": "AI Standardization and Quality Assurance",
    "start": "2025-05-05",
    "end": "2025-05-07",
    "deadline": "2024-03-10",
    "city": "Santa Clara",
    "country": "USA",
    "link": "https://ieeeaiindustrystandard.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2aRARBvPEeTpeXVT7",
    "note": "Fast advances in AI technologies and evolutionary machine learning bring a strong demand for AI standards and quality assurance control systems to ensure the high-quality of deployed AI systems in terms of trustworthy, safety, and security."
  },
  {
    "shortName": "CAI",
    "name": "IEEE Conference on Artificial Intelligence",
    "start": "2025-05-05",
    "end": "2025-05-07",
    "deadline": "2024-01-25",
    "city": "Santa Clara",
    "country": "USA",
    "link": "https://cai.ieee.org/2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2aRARBvPEeTpeXVT7",
    "note": "The IEEE Conference on Artificial Intelligence (IEEE CAI) is an international conference and exhibition with an emphasis on the applications of AI and key AI verticals that impact industrial technology applications and innovations. You will learn about new research and breakthroughs in the industry, gain insight into new start-ups and leading AI companies, grow your network, and get inspired by the brightest minds working in the multi-faceted fields. Plan now to attend this highly anticipated spectacular event, taking place May 5-7, 2025 in Santa Clara, CA."
  },
  {
    "shortName": "ISMR",
    "name": "International Symposium on Medical Robotics",
    "start": "2025-05-14",
    "end": "2025-05-16",
    "deadline": "2024-11-15",
    "city": "Atlanta",
    "country": "USA",
    "link": "https://ismr.gatech.edu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/VEF6go5KDGLzKw587",
    "note": "The goal of ISMR is to bring together world-class researchers to present state-of-the-art research achievements and advances in surgical robotics, image-guided interventions, rehabilitation and assistive robotics, and prosthetics, as well as discuss challenges from the clinical point of view and address industry needs. It is envisioned that medical robots will integrate emerging technologies including soft robotics, smart materials, ergonomics, co-robotics, and artificial intelligence in the near future, and these topics will be featured in the symposium."
  },
  {
    "shortName": "ICUAS",
    "name": "The 2025 International Conference on Unmanned Aircraft Systems",
    "start": "2025-05-14",
    "end": "2025-05-17",
    "deadline": "2025-02-07",
    "city": "Charlotte",
    "country": "USA",
    "link": "https://uasconferences.com/2025_icuas/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/48ABd64VVqXJBnsj9",
    "note": "The 2025 International Conference on Unmanned Aircraft Systems, ICUAS 2025, will take place in Charlotte, NC, USA, on May 14-17. Details about the conference, the technical program, important deadlines, and the social agenda may be found at www.uasconferences.com."
  },
  {
    "shortName": "CRV",
    "name": "Conference on Robots and Vision",
    "start": "2025-05-26",
    "end": "2025-05-30",
    "deadline": "2025-02-07",
    "city": "Calgary",
    "country": "Canada",
    "link": "https://www.computerrobotvision.org/",
    "type": "Conference",
    "addressLink": "",
    "note": "The Conference on Robots and Vision (previously the Conference on Computer and Robot Vision) is an annual conference hosted in Canada sponsored by the Canadian Image Processing and Pattern Recognition Society (CIPPRS) and will be co-located with the Canadian Artificial Intelligence (AI) conference"
  },
  {
    "shortName": "ERAS",
    "name": "IEEE International Conference on Engineering Reliable Autonomous Systems",
    "start": "2025-05-29",
    "end": "2025-05-30",
    "deadline": "2025-02-28",
    "city": "Worcester",
    "country": "USA",
    "link": "https://erasrobotics.org/2025/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/fexoZToKnKjJfkcA7",
    "note": "ERAS aims to offer a space for all stakeholders across autonomous system reliability to come together to discuss the key progress made towards solving them. The scope of the conference is the aspects of engineering reliable autonomous systems, ranging from systems and software engineering to their verification purpose of this conference, “autonomous systems” is synonymous with “systems that make their own decisions and can take their own actions” and includes everything from autonomous decision-making software running in a virtual environment to teams of autonomous robots operating in a distributed physical environment, everything from simple reactive systems with no planning capability to complex systems incorporating machine learning and reasoning engines. Contributions addressing aspects of reliability across the entire life cycle of the system are welcome."
  },
  {
    "shortName": "RCAR",
    "name": "The 2025 IEEE International Conference on Real-time Computing and Robotics",
    "start": "2025-06-01",
    "end": "2025-06-06",
    "deadline": "2025-03-10",
    "city": "Toyama",
    "country": "Japan",
    "link": "https://smartconf.jp/content/rcar2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Dj8aNgbMsJE3Tm9M7",
    "note": "The 2025 IEEE International Conference on Real-time Computing and Robotics (IEEE RCAR 2024) will take place from June 1 to 6, 2025 in Toyama, Japan. The objective of this conference is to provide a forum for researchers in robotics and real-time computing to share the latest results and explore the opportunity of research collaboration. With wide applications of robots in industry and services sectors, real-time computing plays one of the major roles in various topics in robotics including real-time control, human-robot interactions, sensor perception and fusion, robot intelligence, etc. The scope of RCAR 2025 covers research, development and applications in the dynamic and exciting areas of real-time computing and robotics."
  },
  {
    "shortName": "CogSIMA",
    "name": "The 2025 IEEE Conference on Cognitive and Computational Aspects of Situation Management",
    "start": "2025-06-02",
    "end": "2025-06-05",
    "deadline": "2024-12-20",
    "city": "Duisburg",
    "country": "Germany",
    "link": "https://edas.info/web/cogsima2025/home.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/qgyy5s3kedVXubh87",
    "note": "The 2025 IEEE Conference on Cognitive and Computational Aspects of Situation Management (CogSIMA) will be held at the University of Duisburg-Essen, Campus Duisburg, from June 2 - 5, 2025. CogSIMA 2025 is sponsored by the IEEE Systems, Man, and Cybernetics Society (SMCS) and supported by the IEEE SMCS Technical Committees on Cognitive Situation Management and on Interactive and Wearable Computing and Devices."
  },
  {
    "shortName": "L4DC",
    "name": "Annual Learning for Dynamics and Control Conference",
    "start": "2025-06-04",
    "end": "2025-06-06",
    "deadline": "2024-11-22",
    "city": "Ann Arbor, Michigan",
    "country": "USA",
    "link": "https://sites.google.com/umich.edu/l4dc2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/oLiG3MeYNCPhnXyZ6",
    "note": "The explosion of real-time data that is emerging from the physical world requires a rapprochement of areas such as machine learning, control theory, and optimization. While control theory has been firmly rooted in the tradition of model-based design, the availability and scale of data (both temporal and spatial) will require rethinking the foundations of our discipline. From a machine learning perspective, one of the main challenges going forward is to go beyond pattern recognition and address problems in data-driven control and optimization of dynamical processes. Our overall goal is to create a new community of people who think rigorously across the disciplines, ask new questions, and develop the foundations of this new scientific area. We are happy to welcome you to the University of Michigan for the 7th annual L4DC."
  },
  {
    "shortName": "LION",
    "name": "The 2025 Learning and Intelligent Optimization Conference",
    "start": "2025-06-15",
    "end": "2025-06-19",
    "deadline": "2025-01-31",
    "city": "Prague",
    "country": "Czech",
    "link": "https://lion19.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/tLvogpma1ei2fvMZ8",
    "note": "The main purpose of the venue is to bring together experts from these areas to discuss new ideas and methods, challenges and opportunities in various application areas, general trends and specific developments."
  },
  {
    "shortName": "CRI",
    "name": "International Conference on Child-Robot Interaction",
    "start": "2025-06-18",
    "end": "2025-06-20",
    "deadline": "2024-12-15",
    "city": "Milan",
    "country": "Italy",
    "link": "https://cri.unimib.it/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Q91i3tZYYGhBbLPy9",
    "note": "We encourage submissions from all disciplines, including (but not limited to) psychology, philosophy, sociology, engineering, education, anthropology, arts and architecture."
  },
  {
    "shortName": "ICRAS",
    "name": "9th International Conference on Robotics and Automation Sciences",
    "start": "2025-06-27",
    "end": "2025-06-29",
    "deadline": "2025-03-15",
    "city": "Osaka",
    "country": "Japan",
    "link": "http://www.icras.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/oYcm4qNfm8q9P3qQ8",
    "note": ""
  },
  {
    "shortName": "RSS",
    "name": "Robotics: Science and Systems",
    "start": "2025-06-21",
    "end": "2025-06-25",
    "deadline": "2025-01-17",
    "city": "Los Angeles",
    "country": "USA",
    "link": "https://roboticsconference.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/5x32qxErG46f438Y9",
    "note": "RSS has a long history of bringing together researchers in all areas of robotics from around the world for an engaging and focused week of single-track presentations, workshops, poster sessions, and tutorials. This year, as always, we solicit your best work."
  },
  {
    "shortName": "UR",
    "name": "22nd International Conference on Ubiquitous Robots",
    "start": "2025-06-30",
    "end": "2025-07-02",
    "deadline": "2025-02-28",
    "city": "College Station, TX",
    "country": "USA",
    "link": "http://2025.ubiquitousrobots.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/MK1zz35AyuEqoRG4A",
    "note": "Since its inception in 2004, UR has grown into a prominent mid-size robotics conference, uniting researchers from around the globe who share the vision of integrating robots into everyday life to connect and empower humanity. As robotics stands at the crossroads of multiple disciplines, UR 2025 welcomes contributions from across the foundational spectrum-design, perception, manipulation, mobility, interface, and intelligence- as well as various application domains, including healthcare, security, defense, disaster response, agriculture, construction, manufacturing, and more."
  },
  {
    "shortName": "RAMI",
    "name": "Marine Robots Competition",
    "start": "2025-06-29",
    "end": "2025-07-04",
    "deadline": "2025-04-15",
    "city": "La Spezia",
    "country": "Italy",
    "link": "https://rami2025.tilda.ws/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/hhA7y1KCPE5vaT4U7",
    "note": "A component of critical undersea infrastructure, used for oil transportation, is to be investigated after suspicious activities, spotted by a drone, have caused a malfunction, as reported by the plant safety systems. From what is known, a pipeline has started leaking and an explosion may occur soon. A robotics team composed of Autonomous Underwater Vehicles (AUVs) and their human operators is ready to intervene."
  },
  {
    "shortName": "IAS",
    "name": "Intelligent Autonomous Systems",
    "start": "2025-06-30",
    "end": "2025-07-04",
    "deadline": "2025-02-15",
    "city": "Genova",
    "country": "Italy",
    "link": "http://ias-19.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/uL1TorzzaK3uVD3u9",
    "note": "This edition's motto, ‘Ethical, Responsible, and Inclusive Robotics’, reflects our community's commitment to promoting the design and development of robot technologies that are meant to benefit all humans, and which purposes are to enrich all lives and augment the possibilities for all people."
  },
  {
    "shortName": "AIR",
    "name": "International Conference of The Robotics Society - Advances in Robotics",
    "start": "2025-07-02",
    "end": "2025-07-05",
    "deadline": "2024-02-15",
    "city": "Jodhpur",
    "country": "India",
    "link": "https://advancesinrobotics.com/2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/MuoHreocSJ8FUg4BA",
    "note": "Advances in Robotics (AIR) is a series of biennial conferences organized by The Robotics Society (earlier referred to as the Robotics Society of India). The conference aims to create a forum to present and exchange new ideas by researchers and developers from India and abroad working in the fields of robotics and its applications. The conference would have expert talks, oral and poster presentations, workshops, a doctoral symposium, and special industry-oriented sessions. The organizers of the conference invite unpublished research work in the various fields of Robotics."
  },
  {
    "shortName": "ICRES",
    "name": "International Conference on Robot Ethics and Standards",
    "start": "2025-07-03",
    "end": "2025-07-04",
    "deadline": "2025-02-15",
    "city": "Porto",
    "country": "Portugal",
    "link": "hhttps://clawar.org/icres2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/DMiyHyZ9PDGrbSDSA",
    "note": "The International Conference on Robot Ethics and Standards is dedicated to the safe and ethical development of Robotic and AI applications, progressing toward trustworthy intelligent technology."
  },
  {
    "shortName": "ISER",
    "name": "International Symposium on Experimental Robotics",
    "start": "2025-07-06",
    "end": "2025-07-10",
    "deadline": "2025-03-15",
    "city": "Santa Fe",
    "country": "USA",
    "link": "https://iser2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/3NpbGV978BRHyPEc8",
    "note": "ISER 2025 focuses on experimental validation of robotics theory through physical experiments. The symposium encourages innovative robotics research that bridges theoretical advancements with real-world applications, offering a platform for presenting both fundamental and applied work in robotics."
  },
  {
    "shortName": "AMAM",
    "name": "AMAM/LokoAssist Symposium",
    "start": "2025-07-08",
    "end": "2025-07-11",
    "deadline": "2025-02-28",
    "city": "Darmstadt",
    "country": "Germany",
    "link": "https://www.tu-darmstadt.de/lokoassist/home_lokoassist/news_und_events_lokoassist/amam25/amam25.en.jsp",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/9fhstsocC4p2s62U6",
    "note": "Exploring how animals and humans excel in adaptive movements, particularly locomotion, provides valuable insights for engineers seeking to enhance the adaptive capabilities of robots. In turn, robots serve as scientific tools to investigate the fundamental principles of biological systems, especially the neuromechanical mechanisms behind their remarkable motor abilities. This “adaptive intelligence” can be harnessed to design robots that improve our lives by assisting with locomotion. To comprehensively address the understanding of biological movement, the design of bioinspired robots, and their applications in assisting both humans and animals, we have merged the 12th AMAM symposium with the 2nd LokoAssist symposium, forming the AMAM/LokoAssist 2025 Symposium."
  },
  {
    "shortName": "WHC",
    "name": "IEEE World Haptics Conference",
    "start": "2025-07-08",
    "end": "2025-07-11",
    "deadline": "2025-01-31",
    "city": "Suwon",
    "country": "Korea (South)",
    "link": "http://2025.worldhaptics.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/mivANV1FivwWGuGS8",
    "note": "WHC is a joint gathering of IEEE Haptics Symposium and Eurohaptics Conference which takes place in alternate years and rotates among North America, Europe and Asia. WHC 2025 will take place in Suwon, South Korea from July, 8th-11th, 2025. The conference will offer an exciting program including cross-cutting challenge sessions, technical paper oral and poster sessions, work-in-progress sessions, demonstrations, industrial exhibits, workshops/tutorials and other technical and social activities."
  },
  {
    "shortName": "CABLECON",
    "name": "International Conference on Cable-Driven Parallel Robots",
    "start": "2025-07-08",
    "end": "2025-07-11",
    "deadline": "2025-01-27",
    "city": "Hong Kong",
    "country": "Hong Kong",
    "link": "https://cablecon-2025.sciencesconf.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/4YegRXWuhhyakGe3A",
    "note": "The first six conferences of this series successfully established a worldwide forum for research on cable-driven parallel robots. From Stuttgart, Duisburg, Quebec City, Krakow and Montpellier (online), Nantes, the next edition of the conference will be in Hong Kong on 8-11 July 2025. CableCon2025 aims at presenting new results, continuing the forum for the exchange of ideas, and establishing contacts amongst all international teams, for academics, researchers and industry."
  },
  {
    "shortName": "CoDIT",
    "name": "11th International Conference on Control, Decision and Information Technologies",
    "start": "2025-07-15",
    "end": "2025-07-18",
    "deadline": "2025-03-07",
    "city": "Split",
    "country": "Croatia",
    "link": "http://codit2025.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/CuGf4erKXLM2Pd839",
    "note": ""
  },
  {
    "shortName": "AIM",
    "name": "IEEE/ASME International Conference on Advanced Intelligent Mechatronics",
    "start": "2025-07-14",
    "end": "2025-07-18",
    "deadline": "2025-02-01",
    "city": "Hangzhou",
    "country": "China",
    "link": "http://aim2025.org/",
    "type": "Conference",
    "addressLink": "",
    "note": "The 2025 IEEE/ASME International Conference on Advanced Intelligent Mechatronics (AIM2025) is set to be held on July 14-18, 2025 in Hangzhou, China, a city famous for its enchanting West Lake, vibrant tech environment, and rich cultural heritage. Serving as a leading conference in the field of intelligent mechatronic systems, AIM 2025 is committed to advancing diversity in the technology industry, promoting a culture of inclusion and equity, and welcoming, engaging, and rewarding all who contribute to the field and will bring together experts and researchers from around the world to exchange views on cutting-edge research outcomes and future developments."
  },
  {
    "shortName": "IFACMEC",
    "name": "IFAC Symposium on Mechatronic Systems",
    "start": "2025-07-15",
    "end": "2025-07-18",
    "deadline": "2025-01-15",
    "city": "Paris",
    "country": "France",
    "link": "https://ifac2025-msrob.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/SbVmh4ha6rZsvEdS7",
    "note": "We are delighted to invite you to the joint Symposia of the 10th IFAC Symposium on Mechatronic Systems (MECHATRONICS 2025) and the newly rebranded 14th IFAC Symposium on Robotics (ROBOTICS 2025), which was previously known as “SYROCO.” Both Symposia will be held in the beautiful city of Paris from July 15 to July 18, 2025, and are triennial events, occurring every three years. We are also delighted that the “2025 IFAC Council & Related meetings” will be in conjunction with the two Symposia in Paris."
  },
  {
    "shortName": "CACRE",
    "name": "10th International Conference on Automation, Control and Robotics Engineering",
    "start": "2025-07-16",
    "end": "2025-07-19",
    "deadline": "",
    "city": "Wuxi",
    "country": "China",
    "link": "http://cacre.org/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "ICBBS",
    "name": "International Conference on Biomimetics and Biohybrid Systems",
    "start": "2025-07-15",
    "end": "2025-07-18",
    "deadline": "2025-03-30",
    "city": "Sheffield",
    "country": "UK",
    "link": "https://livingmachinesconference.eu/2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/HiviNF8oqSL76hnc7",
    "note": "The development of future real-world technologies will depend strongly on our understanding and harnessing of the principles underlying living systems and the flow of communication signals between living and artificial systems."
  },
  {
    "shortName": "ARSO",
    "name": "IEEE International Conference on Advanced Robotics and its Social Impacts",
    "start": "2025-07-17",
    "end": "2025-07-19",
    "deadline": "2025-02-28",
    "city": "Osaka",
    "country": "Japan",
    "link": "http://ieee-arso.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/gDMoWQavuVk9BEm36",
    "note": "Advanced robots are expected to enter in promising applications in our future society and bring substantial impacts. The increasing implementation of AI-based components even broadens their fields of application. To ensure that these impacts are positively reflected, today, we need to extend views not only on technical aspects but also on social challenges that we might face, which include safety, regulation, ethics, human factors, and philosophy."
  },
  {
    "shortName": "MARSS",
    "name": "International Conference on Manipulation, Automation and Robotics at Small Scales",
    "start": "2025-07-28",
    "end": "2025-08-01",
    "deadline": "",
    "city": "West Lafayette",
    "country": "USA",
    "link": "http://marss-conference.org/",
    "type": "Conference",
    "addressLink": "https://www.openstreetmap.org/relation/12444296#map=16/40.42781/-86.92443",
    "note": "MARSS, the annual International Conference on Manipulation, Automation and Robotics at Small Scales, is a non-profit conference run by the microrobotic community and technically supported by IEEE-RAS and IEEE-NTC. MARSS2025 will be held in-person on July 28-August 01, 2025, at Purdue University in West Lafayette, IN, USA. The conference is the flagship forum to discuss cross-disciplinary activities on 1) manipulation, automation, measurement, and characterization at micro/nano scales, and 2) all kinds of small-scale robots (nm – cm) and their applications."
  },
  {
    "shortName": "MVA",
    "name": "19th International Conference on Machine Vision and Applications",
    "start": "2025-07-25",
    "end": "2025-07-28",
    "deadline": "2025-03-31",
    "city": "Kyoto",
    "country": "Japan",
    "link": "https://mva-org.jp/mva2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/56xNJZjhkLGiBGbc8",
    "note": ""
  },
  {
    "shortName": "ICMAEA",
    "name": "International Conference on Mechanical Automation and Engineering Applications",
    "start": "2025-08-01",
    "end": "2025-08-03",
    "deadline": "2025-04-10",
    "city": "Chongqing",
    "country": "China",
    "link": "http://www.icmaea.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ByqQ24q5apvsWdpBA",
    "note": ""
  },
  {
    "shortName": "ICARM",
    "name": "International Conference on Advanced Robotics and Mechatronics",
    "start": "2025-08-01",
    "end": "2025-08-03",
    "deadline": "2025-02-28",
    "city": "Portsmouth",
    "country": "United Kingdom",
    "link": "http://www.ieee-arm.org",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "ICMA",
    "name": "IEEE International Conference on Mechatronics and Automation",
    "start": "2025-08-03",
    "end": "2025-08-06",
    "deadline": "2025-04-10",
    "city": "Beijing",
    "country": "China",
    "link": "http://2025.ieee-icma.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/zo8xWmLdP1xsmtfj7",
    "note": ""
  },
  {
    "shortName": "COINS",
    "name": "IEEE International Conference on Omni-layer Intelligent Systems",
    "start": "2025-08-04",
    "end": "2025-08-06",
    "deadline": "2025-04-08",
    "city": "Madison",
    "country": "USA",
    "link": "https://coinsconf.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ruiFpRWcmZhYhb4r8",
    "note": " IEEE COINS brings together experts in Digital Transformation (from AI and IoT to Cloud, Blockchain, Cybersecurity, and Robotics) from around the globe. IEEE COINS includes a multi-disciplinary program from technical research papers, to panels, workshops, and tutorials on the latest technology developments and innovations addressing all important aspects of the IoT & AI ecosystem."
  },
  {
    "shortName": "IDETC-CIE",
    "name": "International Design Engineering Technical Conferences & Computers and Information in Engineering Conference",
    "start": "2025-08-17",
    "end": "2025-08-20",
    "deadline": "2025-03-17",
    "city": "Anaheim",
    "country": "USA",
    "link": "https://event.asme.org/IDETC-CIE",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/YzXHTUr8hL5ingbS7",
    "note": "IDETC-CIE 2025 covers design engineering, automation, robotics, and information in engineering, bringing together over 1,000 professionals. The event includes technical tracks, networking, and workshops."
  },
  {
    "shortName": "CASE",
    "name": "IEEE International Conference on Automation Science and Engineering",
    "start": "2025-08-18",
    "end": "2025-08-22",
    "deadline": "2025-03-01",
    "city": "Los Angeles, CA",
    "country": "USA",
    "link": "http://www.case2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/iuBKu2HiaiFtX2nd7",
    "note": "The IEEE International Conference on Automation Science and Engineering (CASE) is the flagship automation conference of the IEEE Robotics and Automation Society (RAS) and constitutes the primary forum for cross-industry and multidisciplinary research in automation. Its goal is to provide broad coverage and dissemination of foundational research in automation among researchers and practitioners."
  },
  {
    "shortName": "IRCE",
    "name": "8th International Conference on Intelligent Robotics and Control Engineering",
    "start": "2025-08-18",
    "end": "2025-08-21",
    "deadline": "2025-03-30",
    "city": "Kunming",
    "country": "China",
    "link": "http://www.irce.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/vw7Zfkdmg5DMebiy6",
    "note": "It is our great pleasure to invite you to join 2025 the 8th International Conference on Intelligent Robotics and Control Engineering (IRCE), which will be hosted in Kunming, China during August 18-21, 2025. IRCE is sponsored by Kunming University of Science and Technology, China, hosted by Faculty of Mechanical and Electrical Engineering, KUST, patrons are Concordia University, Canada, Northeastern University, China, Nankai University, China, Southeast University, China, Northeast Electric Power University, China, and Tianjin University, China etc.. This event will provide unique opportunity to have fruitful discussions about Intelligent Robotics, Automations and Control Engineering, and best practices that address Artificial Intelligence. The IRCE conference aims to foster interdisciplinary and international collaboration opportunities, and strengthen domestic and international recognition in pure and applied research for the participants."
  },
  {
    "shortName": "M2VIP",
    "name": "31st International Conference on Mechatronics and Machine Vision in Practice",
    "start": "2025-08-19",
    "end": "2025-08-22",
    "deadline": "2025-05-01",
    "city": "Manila",
    "country": "Philippines",
    "link": "https://m2vip.dlsu.edu.ph",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/w2TNwuoePsVqm7tT6",
    "note": "M2VIP 2025 focuses on practical applications of mechatronics and machine vision, covering topics such as AI-driven automation, robotics, and industrial applications."
  },
  {
    "shortName": "IHCIT",
    "name": "4th International Conference on Intelligent Mechanical and Human-Computer Interaction Technology",
    "start": "2025-08-22",
    "end": "2025-08-24",
    "deadline": "",
    "city": "Beijing",
    "country": "China",
    "link": "http://www.ihcit.net",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "TAROS",
    "name": "TAROS Conference",
    "start": "2025-08-20",
    "end": "2025-08-22",
    "deadline": "2025-02-21",
    "city": "York",
    "country": "UK",
    "link": "https://taros-conference.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/EZ4gTYHdAaVjURvX7",
    "note": "TAROS is the longest-running UK-hosted international conference on robotics and autonomous systems, aimed at the presentation and discussion of the latest results and methods in autonomous robotics research and applications.  In 2025, the RoboStar (robostar.cs.york.ac.uk) centre of excellence on Software Engineering for Robotics, in collaboration with colleagues at the Universities of York and Leeds, are organising TAROS at the University of York, from the 20th to the 22nd of August."
  },
  {
    "shortName": "ROMAN",
    "name": "IEEE International Conference on Robot and Human Interactive Communication",
    "start": "2025-08-25",
    "end": "2025-08-29",
    "deadline": "2025-03-20",
    "city": "Eindhoven",
    "country": "Netherlands",
    "link": "http://www.ro-man2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/w9RcYLGyMAPNDmVk8",
    "note": "While robots become increasingly more able to socially interact with people, it is important to start thinking about how we can shape a future with these robots in which we collaborate and work together with these new team members that are on the horizon. Rather than replacing us, our vision is that robots will complement us. We envision a hybrid intelligence where robots and humans together will be more able, effective, productive, efficient, and fun to work with. To realize a successful integration of these socially interactive robots into our society, we need to invest in a future where human-robot teams could become prevalent. To this end, we need to create a clear vision of this future and create innovations related to interaction models, social capabilities, and the skills of these robots to understand how they can work together with us."
  },
  {
    "shortName": "MMAR",
    "name": "29th International Conference on Methods and Models in Automation and Robotics",
    "start": "2025-08-26",
    "end": "2025-08-29",
    "deadline": "2025-03-03",
    "city": "Miedzyzdroje",
    "country": "Poland",
    "link": "http://www.mmar.edu.pl",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/GcA8PNbheKBH4bVZ9",
    "note": ""
  },
  {
    "shortName": "ICAC",
    "name": "30th International Conference on Automation and Computing",
    "start": "2025-08-27",
    "end": "2025-08-29",
    "deadline": "2025-03-31",
    "city": "Loughborough",
    "country": "United Kingdom",
    "link": "https://cacsuk.co.uk/icac/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/6bG14aZNNHNocmjq9",
    "note": ""
  },
  {
    "shortName": "MAIQS",
    "name": "International Conference on Measurement, AI, Quality, and Sustainability",
    "start": "2025-08-26",
    "end": "2025-08-28",
    "deadline": "2025-04-15",
    "city": "London",
    "country": "UK",
    "link": "https://maiqs2025.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/S2Kq1SXgLTJUfUBV7",
    "note": "The 21st century is witnessing a new phase of humanity history characterised by unprecedented crises and rapid technological advancements at the same time, both on a global scale.  The former includes increasingly perilous and widespread conflicts, global health crises, economic inequality and climate change, whilst the latter is driven by smart technology, Industry 4.0 and artificial intelligence.  These global crises are fundamentally linked to issues of quality and sustainability, either directly or indirectly, echoing the prophetic words of quality guru Joseph Juran: The 20th century has been the Century of Productivity, but the 21st century will be the Century of Quality"
  },
  {
    "shortName": "ICIA",
    "name": "International Conference on Information and Automation",
    "start": "2025-08-28",
    "end": "2025-08-31",
    "deadline": "",
    "city": "Lanzhou",
    "country": "China",
    "link": "http://www.icia2025.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/iyyzSCuCayvmg6e27",
    "note": ""
  },
  {
    "shortName": "AGRICONTROL",
    "name": "IFAC Conference on Sensing, Control and Automation Technologies for Agriculture",
    "start": "2025-08-27",
    "end": "2025-08-29",
    "deadline": "2025-01-31",
    "city": "Davis, CA",
    "country": "USA",
    "link": "https://agricontrol25.sf.ucdavis.edu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ik5Vp49q4Dc8TmHH6",
    "note": "This conference aims to provide an international forum for new methods and developments in sensing, control, and automation research and emerging results in agricultural production and automation. The conference brings together scientists, researchers, and scholars in the domain of interest from around the world to share ideas, techniques, challenges, and concerns with peers and expand their professional networks."
  },
  {
    "shortName": "ECMR",
    "name": "European Conference on Mobile Robots",
    "start": "2025-09-02",
    "end": "2025-09-05",
    "deadline": "2025-04-17",
    "city": "Padova",
    "country": "Italy",
    "link": "https://ecmr2025.dei.unipd.it",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/EefN3EaScTdakkMG9",
    "note": "We are excited to invite submissions to the 12th European Conference on Mobile Robots (ECMR 2025). Following a successful journey from Radziejowice to Ancona, Freiburg, Mlini/Dubrovnik, Örebro, Barcelona, Lincoln, Paris, Prague, Bonn, and Coimbra, the next edition will be held in Padova. This time, we will focus on the cognitive capabilities of today’s and tomorrow’s mobile robots, emphasizing cognition, perception, interaction, and AI-enhanced autonomy."
  },
  {
    "shortName": "ICCB",
    "name": "11th International Conference on Computational Bioengineering",
    "start": "2025-09-08",
    "end": "2025-09-10",
    "deadline": "2025-03-31",
    "city": "Rome",
    "country": "Italy",
    "link": "https://iccb2025.org/",
    "type": "Conference",
    "addressLink": "https://www.openstreetmap.org/way/224640836/",
    "note": "ICCB 2025 focuses on modeling physiological systems across molecular to population scales. The conference includes keynote lectures, mini-symposia, and sessions on computational bioengineering advances, fostering interdisciplinary collaboration."
  },
  {
    "shortName": "TELEPRESENCE",
    "name": "IEEE Conference on Telepresence 2025",
    "start": "2025-09-08",
    "end": "2025-09-10",
    "deadline": "2025-04-12",
    "city": "Leiden",
    "country": "Netherlands",
    "link": "https://conf.telepresence.ieee.org/",
    "type": "Conference",
    "addressLink": "https://maps.google.com/?q=Leiden,+Netherlands",
    "note": "TELEPRESENCE 2025 focuses on telepresence systems, telerobotics, haptics, human-machine interfaces, and autonomy. It includes keynotes, industry panels, and exhibits, with accepted papers published in IEEE Xplore."
  },
  {
    "shortName": "ICMTAE",
    "name": "5th International Conference on Mechatronics Technology and Aerospace Engineering",
    "start": "2025-09-12",
    "end": "2025-09-14",
    "deadline": "",
    "city": "Fuzhou",
    "country": "China",
    "link": "http://www.icmtae.org/",
    "type": "Conference",
    "addressLink": "",
    "note": "ICMTAE 2025 Conference will be held in Fuzhou, China from September 12-14, 2025. It will focus on 'Mechatronics', 'Electrical and Electronic Technology', 'Aerospace Engineering' and 'Aeronautical Engineering', etc. The conference will provide an international platform for experts, professors, scholars and engineers from universities, research institutes, enterprises and institutions at home and abroad to share their professional experiences, expand their professional networks, exchange new ideas and present their research results, discuss the key challenges and research directions facing the development of this field, promote the development and application of theories and technologies in universities and enterprises in this field, and also provide a platform for the participants to establish their business and application. It also provides a platform for participants to establish business or research contacts and find global partners for their future careers. Experts and scholars from universities and research institutions at home and abroad are warmly welcomed to submit papers and attend the conference!"
  },
  {
    "shortName": "ICSR",
    "name": "International Conference on Social Robotics + AI",
    "start": "2025-09-10",
    "end": "2025-09-12",
    "deadline": "2025-03-28",
    "city": "Naples",
    "country": "Italy",
    "link": "https://icsr2025.eu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/wx49nGCnmEVfkJ4s8",
    "note": "The conference theme, Emotivation at the Core: Empowering Social Robots to Inspire and Connect, highlights the essential role of “Emotivation” in social robotics. Emotivation captures the synergy between emotion and motivation, where emotions trigger and sustain motivation during interactions. In social robotics, this concept is key to building trust, fostering empathy, and supporting decision-making by enabling robots to respond sensitively to human emotions, inspiring engagement and action. For this year’s edition, we are excited to introduce several new elements designed to enhance your experience and enrich the discussions."
  },
  {
    "shortName": "ICDL",
    "name": "IEEE International Conference on Development and Learning",
    "start": "2025-09-16",
    "end": "2025-09-19",
    "deadline": "2025-04-03",
    "city": "Prague",
    "country": "Czech Republic",
    "link": "http://icdl2025.fel.cvut.cz/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Ve126cAFYy92AsW38",
    "note": "The IEEE International Conference on Development and Learning (ICDL) conference is a unique meeting gathering researchers from computer science, robotics, psychology, neuroscience, and other disciplines to share and discuss research on how humans and other animals learn and develop and how this can inform and be informed by robotics and machine learning systems."
  },
  {
    "shortName": "CORL",
    "name": "Conference on Robot Learning",
    "start": "2025-09-27",
    "end": "2025-09-30",
    "deadline": "2025-04-28",
    "city": "Seoul",
    "country": "Korea (South)",
    "link": "https://www.corl.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/PL9Y8VCkXkAxb5JF9",
    "note": "The Conference on Robot Learning (CoRL) is a scientific conference where advancements in the intersection of robotics and machine learning are shared and explored. Since its inception in 2017, CoRL has been dedicated to fostering cutting-edge research and innovation across these dynamic fields. Now in its 8th edition, the conference continues to draw a global audience of researchers, practitioners, and industry experts eager to present their findings, discuss challenges, and shape the future of robot learning."
  },
  {
    "shortName": "Humanoids",
    "name": "IEEE-RAS International Conference on Humanoid Robots",
    "start": "2025-09-30",
    "end": "2025-10-02",
    "deadline": "2025-05-01",
    "city": "Seoul",
    "country": "Korea (South)",
    "link": "https://2025humanoids.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/PL9Y8VCkXkAxb5JF9",
    "note": "Robotics enthusiasts, ranging from experts in software and hardware to vision and perception, natural language processing, motion, and dexterity, will come together at COEX from September 27 to October 2. Robotics Week, a dedicated event for robotics and AI enthusiasts, will provide a unique opportunity to explore advancements in humanoid robots and machine learning."
  },
  {
    "shortName": "ICMI",
    "name": "27th ACM International Conference on Multimodal Interaction",
    "start": "2025-10-13",
    "end": "2025-10-17",
    "deadline": "2025-04-25",
    "city": "Canberra",
    "country": "Australia",
    "link": "https://icmi.acm.org/2025/",
    "type": "Conference",
    "addressLink": "https://www.openstreetmap.org/way/949579039#map=19/-35.311934/149.133152",
    "note": "ICMI 2025 is the premier conference on multimodal artificial intelligence and social interaction research, featuring keynote speakers, technical papers, demonstrations, and workshops. It promotes interdisciplinary studies in AI-driven multimodal systems and human-computer interaction."
  },
  {
    "shortName": "CBS",
    "name": "IEEE International Conference on Cyborg and Bionic Systems",
    "start": "2025-10-17",
    "end": "2025-10-19",
    "deadline": "2025-05-01",
    "city": "Beijing",
    "country": "China",
    "link": "https://www.ieee-cbs2025.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/VooVPp9yBDYwKDj37",
    "note": "CBS is an international conference to to discuss frontier research and realistic application on cyborg and bionic systems, which are concerned with hybrid fusion of organic and biomechatronic body parts with the integration of some artificial components or technology like bio-hybrid actuators and sensors. With the rapid development of bionic technology, we think that cyborg and bionic systems can assist human to conquer many limitations such as disease, speed, strength, as well as intelligence."
  },
  {
    "shortName": "IROS",
    "name": "IEEE/RSJ International Conference on Intelligent Robots and Systems",
    "start": "2025-10-19",
    "end": "2025-10-25",
    "deadline": "2025-03-01",
    "city": "Hangzhou",
    "country": "China",
    "link": "http://www.iros25.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/b1ANTf3SxaGVt8RHA",
    "note": "IROS is a large and impactful forum for the international robotics research community to explore the frontier of science and technology in intelligent robots and smart machines, emphasizing future directions and the latest approaches, designs, and outcomes. In addition to technical sessions and multi-media presentations, IROS conferences also hold panel discussions, forums, workshops, tutorials, exhibits, and technical tours to enrich the fruitful discussions among conference attendees."
  },
  {
    "shortName": "RCAE",
    "name": "8th International Conference on Robotics, Control and Automation Engineering",
    "start": "2025-10-24",
    "end": "2025-10-26",
    "deadline": "2025-06-10",
    "city": "Xi'an",
    "country": "China",
    "link": "http://www.rcae.net/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "ROSCON",
    "name": "ROS Conference",
    "start": "2025-10-27",
    "end": "2025-10-29",
    "deadline": "2025-06-02",
    "city": "Singapore",
    "country": "Singapore",
    "link": "https://roscon.ros.org/2025/",
    "type": "Conference",
    "addressLink": "https://www.openstreetmap.org/way/393090489#map=19/1.293337/103.857633",
    "note": "ROSCon is a developers’ conference, in the model of PyCon and BoostCon. Following the success of our past events, this year’s ROSCon will be our fourteenth ROSCon and held in Singapore. Similar to previous years, the three-day program will comprise a mixture of workshops, technical talks, and tutorials that will introduce you to new tools and libraries, as well as teach you more about the ones you already know. The bulk of the program will be presentations, along with panel discussions, lightning talks, demonstrations, and workshops."
  },
  {
    "shortName": "CLAWAR",
    "name": "International Conference on Climbing and Walking Robots and Support Technologies for Mobile Machines",
    "start": "2025-09-05",
    "end": "2025-09-07",
    "deadline": "2025-04-15",
    "city": "Shenzhen",
    "country": "China",
    "link": "https://clawar.org/clawar2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/pTLByPfrUKgK9KNQ9",
    "note": "CLAWAR 2025 is the 28th issue of the International Conference Series on Climbing and Walking Robots and the Support Technologies for Mobile Machines. The conference will be organized in collaboration with the Shenzhen Technology University, China, and held within the premises of the university, during 05 – 07 September 2025. The technical programme of CLAWAR 2025 will feature plenary, regular and special/invited sessions. The conference proceedings will be published in the Springer’s Lecture Notes in Networks and Systems series and indexed in Scopus, EI and Web of Science."
  },
  {
    "shortName": "ICCAS",
    "name": "25th International Conference on Control, Automation and Systems",
    "start": "2025-11-04",
    "end": "2025-11-07",
    "deadline": "2025-05-31",
    "city": "Incheon",
    "country": "Korea (South)",
    "link": "http://2025.iccas.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/jSUyAU1jeziMpkCB9",
    "note": ""
  },
  {
    "shortName": "ICAR",
    "name": "International Conference on Advanced Robotics",
    "start": "2025-12-02",
    "end": "2025-12-05",
    "deadline": "2025-07-25",
    "city": "San Juan",
    "country": "Argentina",
    "link": "http://icar2025.inaut.unsj.edu.ar/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/FepU67ss4C6vSnP26",
    "note": "As one of the most prestigious and long-standing robotics conferences in the world, ICAR has been at the forefront of robotics innovation since its inception in 1983. Over the years, it has significantly influenced the advancement of robotics, bringing together leading minds to shape the future of the field. ICAR 2025 is proudly supported both technically and financially by the IEEE Robotics and Automation Society. This sponsorship ensures a world-class event featuring a robust technical program and attracting high-caliber attendees from academia, industry, and research institutions globally."
  },
  {
    "shortName": "ICFES",
    "name": "International Conference on Flexible Electronics and Systems",
    "start": "2025-12-11",
    "end": "2025-12-13",
    "deadline": "",
    "city": "Hong Kong",
    "country": "China",
    "link": "http://www.ieee-icfes.org/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "MRS",
    "name": "IEEE International Symposium on Multi-Robot and Multi-Agent Systems",
    "start": "2025-12-04",
    "end": "2025-12-05",
    "deadline": "",
    "city": "Singapore",
    "country": "Singapore",
    "link": "",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "WRS",
    "name": "World Robot Summit - Manufacturing Robotics Challenge",
    "start": "2025-12-12",
    "end": "2025-12-14",
    "deadline": "2025-05-16",
    "city": "Aichi",
    "country": "Japan",
    "link": "https://worldrobotsummit.org/en/wrs2025/mrc/",
    "type": "Conference",
    "addressLink": "https://www.openstreetmap.org/way/729350752",
    "note": "WRS 2025 hosts multiple robotics competitions focusing on future convenience stores (Osaka), disaster response robotics (Fukushima), and manufacturing automation (Aichi). It aims to advance real-world robotic applications."
  }
]