[
  {
    "shortName": "HICSS",
    "name": "Hawaii International Conference on System Sciences",
    "start": "2024-01-03",
    "end": "2024-01-06",
    "deadline": "2023-06-15",
    "city": "Honolulu",
    "country": "USA",
    "link": "https://hicss.hawaii.edu/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/GiqEzTTRmBpDxnX37",
    "note": ""
  },
  {
    "shortName": "SII",
    "name": "IEEE/SICE International Symposium on System Integration",
    "start": "2024-01-08",
    "end": "2024-01-11",
    "deadline": "2023-08-01",
    "city": "Ha Long",
    "country": "Viet Nam",
    "link": "https://sice-si.org/SII2024/index.html",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/5GzgJAFqasP3WsneA",
    "note": ""
  },
  {
    "shortName": "ICAACE",
    "name": "7th International Conference on Advanced Algorithms and Control Engineering",
    "start": "2024-01-26",
    "end": "2024-01-28",
    "deadline": "",
    "city": "Shanghai",
    "country": "China",
    "link": "http://www.icaace.net/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/kp2XkdVwoqvXCpt66",
    "note": "The 2024 7th International Conference on Advanced Algorithms and Control Engineering (ICAACE 2024) will be held on January 26-28, 2024 in Shanghai, China. ICAACE 2024 is to bring together innovative academics and industrial experts in the field of advanced algorithms and control engineering to a common forum. The primary goal of the conference is to promote research and developmental activities in advanced algorithms and control engineering. And another goal is to promote scientific information interchange between researchers, developers, engineers, students, and practitioners working all around the world."
  },
  {
    "shortName": "RAS",
    "name": "Annual IEEE UK and Ireland Robotics and Automation Society Chapter Conference",
    "start": "2024-02-21",
    "end": "2024-02-22",
    "deadline": "2024-02-07",
    "city": "Sheffield",
    "country": "UK",
    "link": "https://www.sheffield.ac.uk/sheffieldrobotics/7th-ieee-uk-ireland-ras-conference-ras-2024",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/B4jibjzUNbzq8Zw7A",
    "note": "Featuring a diverse range of presentations, workshops, and interactive sessions, this event is perfect for anyone passionate about the latest advancements in robotics and automation. Connect with like-minded professionals, researchers, and industry leaders, and gain valuable insights into the cutting-edge technologies shaping our future."
  },
  {
    "shortName": "ICARA",
    "name": "International Conference on Automation, Robotics, and Applications",
    "start": "2024-02-22",
    "end": "2024-02-24",
    "deadline": "2023-11-05",
    "city": "Athens",
    "country": "Greece",
    "link": "http://www.icara.us/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/5CEAPh7Z38ogo3547",
    "note": "The 10th International Conference on Automation, Robotics, and Applications (ICARA 2024) provides a platform for researchers, engineers, and industry professionals to exchange knowledge, share research findings, and discuss the latest advancements in the field. The conference aims to foster collaboration and innovation in automation and robotics, covering a wide range of topics including autonomous systems, control algorithms, intelligent robots, machine vision, human-robot interaction, and applications in various industries."
  },
  {
    "shortName": "ICMCR",
    "name": "2nd International Conference on Mechatronics, Control and Robotics",
    "start": "2024-02-27",
    "end": "2024-02-29",
    "deadline": "",
    "city": "Jeju",
    "country": "Korea (South)",
    "link": "http://www.icmcr.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/WNLxgDYYTKbRY7xj6",
    "note": "ICMCR 2024 is designed not merely as a conference, but as a crucible for innovation. It aims to bring together a melange of researchers, practitioners, and professionals from the industry, academia, and government. This unique amalgamation ensures a holistic understanding of the subject matter, where theoretical foundations meet practical applications."
  },
  {
    "shortName": "ICMRE",
    "name": "International Conference on Mechatronics and Robotics Engineering",
    "start": "2024-02-27",
    "end": "2024-02-29",
    "deadline": "2023-11-09",
    "city": "Milan",
    "country": "Italy",
    "link": "http://www.icmre.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/AADzhzpU9HvLP7N77",
    "note": "The conference aims to stimulate interdisciplinary cooperation and create a space to discuss the emerging trends and challenges in mechatronics and robotics engineering. The rich program includes keynote speeches, interactive workshops, paper presentations, and poster sessions. Key areas of interest cover a broad spectrum including autonomous systems, robotic applications of artificial intelligence, control systems, sensors and actuators, human-robot interaction, and intelligent automation. By prioritizing knowledge exchange and networking, ICMRE offers a conducive environment for attendees to engage in productive dialogues and form beneficial collaborations."
  },
  {
    "shortName": "TAHRI",
    "name": "International Symposium on Technological Advances in Human-Robot Interaction",
    "start": "2024-03-09",
    "end": "2024-03-10",
    "deadline": "2023-12-01",
    "city": "Boulder",
    "country": "USA",
    "link": "https://www.tahri.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/BDMbqd5VEt6ikZcz9",
    "note": "TAHRI seeks novel, high-quality technological HRI contributions from a broad range of perspectives, including, but not limited to, robots, platforms, hardware, software, sensors, actuators, perception, control, algorithms, models, mechanisms, methods, interfaces, architectures, frameworks, benchmarks, datasets, tools, techniques, or other technologies that, with reasonable effort, can be incorporated into the design, development, or deployment of an HRI system."
  },
  {
    "shortName": "HRI",
    "name": "ACM/IEEE International Conference on Human-Robot Interaction",
    "start": "2024-03-11",
    "end": "2024-03-14",
    "deadline": "2023-09-29",
    "city": "Boulder",
    "country": "USA",
    "link": "https://humanrobotinteraction.org/2024/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/V38Us98mFmTaW41w9",
    "note": "The conference theme for HRI 2024 is HRI in the real world and will focus on key HRI theories, designs, studies, systems, and technical advances that aim to bring HRI out of the lab and into everyday life. We encourage the community to consider what it means to do HRI in practice, and ways to bring it into the mainstream."
  },
  {
    "shortName": "ERF",
    "name": "European Robotics Forum",
    "start": "2024-03-13",
    "end": "2024-03-15",
    "deadline": "2023-11-10",
    "city": "Rimini",
    "country": "Italy",
    "link": "https://erf2024.eu/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/uQAbu7SmvmzfS7jZA",
    "note": "The event will see the leading experts, both academic and industrial, at international level in robotics come together in the vibrant city of Rimini and will see the presence of the major European companies with interests in this field. The forum has a unique structure and is specifically designed to encourage interaction between end-users, researchers, technology producers with the ultimate goal of improving industrial competitiveness, fostering scientific progress, stimulating networking between stakeholders in the field, and identifying new impactful application scenarios for robotics."
  },
  {
    "shortName": "ICCAE",
    "name": "International Conference on Computer and Automation Engineering",
    "start": "2024-03-14",
    "end": "2024-03-16",
    "deadline": "2023-10-25",
    "city": "Melbourne",
    "country": "Australia",
    "link": "http://www.iccae.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/qFs8YYhcJTFpJMbE9",
    "note": "The conference aims to bring together global experts, researchers, practitioners, and industry leaders to share their latest research results, explore new areas of research and development, and discuss the challenges and practical solutions in Computer and Automation Engineering. Through collaborative discussion and knowledge sharing, the conference aims to contribute to shaping the future of this exciting and rapidly evolving field."
  },
  {
    "shortName": "EECR",
    "name": "International Conference On Electrical Engineering, Control And Robotics",
    "start": "2024-03-29",
    "end": "2024-03-31",
    "deadline": "2023-11-10",
    "city": "Guangzhou",
    "country": "China",
    "link": "http://www.eecr.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/pvpJAkGjwDwiMdWC6",
    "note": "the 10th International Conference on Electrical Engineering, Control and Robotics (EECR 2024) will be held in Guangzhou, China during March 29-31, 2024. It's co-sponsored by IEEE, IEEE Robotics and Automation Society, and South China Agricultural University, China. The goal of this conference is to foster pure and applied researches in recognition of academic and industry, and to encourage interdisciplinary and international collaboration for the participants."
  },
  {
    "shortName": "CAIF",
    "name": "International Conference on Artificial Intelligence Frontiers",
    "start": "2024-04-01",
    "end": "2024-04-04",
    "deadline": "2024-01-09",
    "city": "Oklahoma City",
    "country": "USA",
    "link": "https://eventutor.com/event/40/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/fGp9v73z6NrMoEXz9",
    "note": "Oklahoma International Publishing (OkIP) is pleased to host the 2024 OkIP International Conference on Artificial Intelligence Frontiers (CAIF). The conference aims to unite scholars from different disciplinary backgrounds to emphasize disseminating ongoing research and development. Proposals are solicited describing original works in the fields and related technologies. This event will include a peer-reviewed program of technical, industrial, and poster sessions."
  },
  {
    "shortName": "HAPTICS",
    "name": "IEEE Haptics Symposium",
    "start": "2024-04-07",
    "end": "2024-04-10",
    "deadline": "2023-10-12",
    "city": "Long Beach, CA",
    "country": "USA",
    "link": "https://2024.hapticssymposium.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/G4HGeT1s64L7nfo16",
    "note": "Held since 1992, the IEEE Haptics Symposium is a vibrant interdisciplinary forum of research in neuroscience, perception, engineering, and design, focused on sharing new advances in our understanding of the sense of touch, sparking new collaborations, and envisioning a future in which physical interactions are enriched through haptic technologies."
  },
  {
    "shortName": "SAC-IRMAS",
    "name": "ACM/SIGAPP Symposium On Applied Computing - Track Intelligent Robotics and Multi-Agent Systems",
    "start": "2024-04-08",
    "end": "2024-04-12",
    "deadline": "2023-09-15",
    "city": "Avila",
    "country": "Spain",
    "link": "https://sac2024-irmas.isr.uc.pt/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/MTdd6bGNmjGNjczP9",
    "note": "Robotics is a multidisciplinary research area that presents an enormous potential. It concerns about developing intelligent robotic systems that are capable of making decisions and acting autonomously in real and unpredictable environments to accomplish tasks and assist humans in relevant application domains for society. Several complex problems require the use of teams of robots that share some of the same challenges studied in MAS."
  },
  {
    "shortName": "RiE",
    "name": "International Conference on Robotics in Education",
    "start": "2024-04-10",
    "end": "2024-04-12",
    "deadline": "2023-01-16",
    "city": "Koblenz",
    "country": "Germany",
    "link": "https://rie.science/2024/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/DkC9WE7XBNUDsGRq6",
    "note": "RiE 2024 aims at bringing academics, researchers, teachers, practicing engineers and industry experts from all over the world onto a common platform. The 2024 Edition of RiE will be held in the wonderful wine, fortress, and congress city of Koblenz, in the middle of Germany. We encourage you to submit and present new trends, practical experiences, innovations and advances in the area of Robotics in Education."
  },
  {
    "shortName": "ICICR",
    "name": "International Conference on Intelligent Computing and Robotics",
    "start": "2024-04-12",
    "end": "2024-04-14",
    "deadline": "",
    "city": "Dalian",
    "country": "China",
    "link": "http://www.icrconf.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ZLURamWdffPSbZSm6",
    "note": "2024 International Conference on Intelligent Computing and Robotics (ICICR2024) will be held in Dalian during April 12-14, 2024. This conference will provide an international forum for researchers, academicians, professionals, and students from Intelligent Computing and Robotics and other related fields to interact and disseminate information on the latest developments. On behalf of our committee, we invite you to join us for an outstanding ICICR2024 conference and we look forward to meeting you in Dalian next April!"
  },
  {
    "shortName": "ROBOSOFT",
    "name": "IEEE International Conference on Soft Robotics ",
    "start": "2024-04-14",
    "end": "2024-04-17",
    "deadline": "2023-11-15",
    "city": "San Diego, CA",
    "country": "USA",
    "link": "https://softroboticsconference.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/kndkRkHvKwdToxpx8",
    "note": "Reflecting this intersection of technology and environment, this year's conference theme is 'Soft Robotics for Exploration'. The demands of exploration require adaptive, resilient, and autonomous systems, whether mapping the earth's surface and ocean depths, or inspecting within the human body. We invite workshop and paper submissioms that advance soft robotics for navigating uncertain environments with safety, dexterity, and autonomy. We also encourage submissions outside of the area of exploration that highlight new developments in soft robotics."
  },
  {
    "shortName": "SEAMS",
    "name": "International Conference on Software Engineering for Adaptive and Self-Managing Systems",
    "start": "2024-04-15",
    "end": "2024-04-16",
    "deadline": "2023-10-06",
    "city": "Lisbon",
    "country": "Portugal",
    "link": "https://conf.researchr.org/home/seams-2024",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/d7rFdhuN2cVLL1nE9",
    "note": "SEAMS is a CORE-A ranked conference that applies software engineering methods, techniques, processes, and tools to support the construction of safe, performant, and cost-effective self-adaptive and autonomous systems that provide self-* properties like self-configuration, self-healing, self-optimization, and self-protection."
  },
  {
    "shortName": "ICCCR",
    "name": "4th International Conference on Computer, Control and Robotics",
    "start": "2024-04-19",
    "end": "2024-04-21",
    "deadline": "",
    "city": "Shanghai",
    "country": "China",
    "link": "http://www.icccr.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/mC4kUeQJHvEoxPgo8",
    "note": "The boundaries between Computer Science, Control Technologies, and Robotics are continuing to be connected. Computers are humanized and a large number of cyber-physical systems are being developed to act upon the physical world. Control technologies provide the basic tools used by robot creators to identify strategies, and optimizers to achieve the goals of the robotic enterprise. Robotic are versatile computing machines with high social impact potential, such as enhance transportation safety, reduce agricultural pesticide use, and improve public safety and crime-fighting efficacy, among other things."
  },
  {
    "shortName": "AIRC",
    "name": "International Conference on Artificial Intelligence, Robotics and Control",
    "start": "2024-04-22",
    "end": "2024-04-24",
    "deadline": "",
    "city": "El Sherouk City",
    "country": "Egypt",
    "link": "http://www.airc.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/a144TqTLQ1PrFdXD6",
    "note": "AIRC 2024 aims to serve as a vibrant forum for scholars, researchers, and engineers to present groundbreaking research, share innovative ideas, and foster meaningful collaborations. We are excited to offer this unique platform for knowledge exchange and professional networking, all set against the backdrop of Cairo's rich cultural tapestry and historical grandeur."
  },
  {
    "shortName": "NSG",
    "name": "Symposium on NLP for Social Good",
    "start": "2024-04-25",
    "end": "2024-04-26",
    "deadline": "2024-03-15",
    "city": "Liverpool",
    "country": "UK",
    "link": "https://nlp4social.github.io/nlp4socialgood/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/kH8zQ52skRJcZTdQ6",
    "note": "Artificial intelligence (AI), specifically, Natural Language Processing (NLP) is being hailed as a new breeding ground for immense innovation potential. While scholars believe that NLP has enormous potential for excessive growth, one question remains: how can it be used for the better welfare of the society? Researchers believe that NLP-based technologies could help to solve societal issues such as equality and inclusion, education, health, and hunger, and climate action etc. and many more. The field is focused on delivering positive social impact in accordance with the priorities outlined in the United Nations’ 17 Sustainable Development Goals (SDGs). Tackling these questions requires a concerted, collaborative effort across all sectors of society."
  },
  {
    "shortName": "ICCAR",
    "name": "10th International Conference on Control, Automation and Robotics",
    "start": "2024-04-27",
    "end": "2024-04-29",
    "deadline": "",
    "city": "Orchard District",
    "country": "Singapore",
    "link": "http://www.iccar.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/GYEsVuZRTWbQEdNh6",
    "note": "This conference will deeply explore the research status and developmental trends in the fields of intelligent robots, automation, control science, and signal processing from both theoretical and practical perspectives. We will offer a comprehensive, high-quality technical program, featuring six special sessions, and provide delegates with the opportunity to connect and network with accomplished professionals from around the world."
  },
  {
    "shortName": "ICARSC",
    "name": "IEEE International Conference on Autonomous Robot Systems and Competitions",
    "start": "2024-05-02",
    "end": "2024-05-03",
    "deadline": "2024-02-24",
    "city": "Paredes de Coura",
    "country": "Portugal",
    "link": "http://icarsc.pt/2024",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/kRRsfRgvZQ9EjMmD6",
    "note": "The conference will take place in Centro Cultural de Paredes de Coura at Paredes de Coura, Portugal, from 2 to 3 of May 2024, in conjunction with the Portuguese Robotics Open, a RoboCup-sponsored Local Event with several other associated competitions. Its scope encompasses, but is not limited to, the fields of Artificial Intelligence, Robotics and Education. The conference is planned for physical participation."
  },
  {
    "shortName": "ICCRE",
    "name": "9th International Conference on Control and Robotics Engineering",
    "start": "2024-05-10",
    "end": "2024-05-12",
    "deadline": "",
    "city": "Osaka",
    "country": "Japan",
    "link": "http://www.iccre.org",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/mQuPUKVvhybKbrHx9",
    "note": "We are thrilled to announce that the ICCRE conference in Osaka, Japan is back! Building upon the success of previous years, we are confident that this year's event will be even more remarkable and rewarding. On behalf of the organizing committee, we extend a heartfelt invitation to you. Come join us at ICCRE 2024 and be a part of the excitement and innovation that awaits in beautiful Osaka!"
  },
  {
    "shortName": "ICHMS",
    "name": " International Conference on Human-Machine Systems",
    "start": "2024-05-15",
    "end": "2024-05-17",
    "deadline": "2023-11-15",
    "city": "Toronto",
    "country": "Canada",
    "link": "https://ichms.blog.torontomu.ca/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Y7pSnqewub9d2pw86",
    "note": "The theme of the 4th ICHMS is “Trustworthy Human-Autonomy Teaming”. The conference will cover progress and contributions on brain-inspired autonomous systems at multiple scales, including cognitive science, engineering, and design for safe and trusted human-autonomy teaming; technological aids for verifiable artificial intelligence (AI) decisions; trust modeling, measures, and management, and fundamental issues of trust and barriers to adoption of AI-enabled autonomy in complex socio-technical systems."
  },
  {
    "shortName": "ICRA",
    "name": "IEEE International Conference on Robotics and Automation",
    "start": "2024-05-13",
    "end": "2024-05-17",
    "deadline": "2023-09-15",
    "city": "Yokohama",
    "country": "Japan",
    "link": "https://2024.ieee-icra.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/mS38bkXnDbce9WTp8",
    "note": "This year's conference theme is ``CONNECT+,'' reflecting the conference's aim of helping to build relationships and potential collaborations with participants within and outside their field of study. The port city of Yokohama is the symbol of Japan's opening to the outside world, and ICRA 2024 will become the symbol of Robotics' opening to the new society with many other fields. ICRA brings together robotics researchers, students and industrial partners from around the world to discuss the latest innovations and breakthroughs, highlighting the role of robotics and automation in addressing global challenges"
  },
  {
    "shortName": "ICCAS",
    "name": "International Conference on Cognitive Aircraft Systems",
    "start": "2024-05-16",
    "end": "2024-05-17",
    "deadline": "2024-03-01",
    "city": "Toulouse",
    "country": "France",
    "link": "https://events.isae-supaero.fr/event/32/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/cXmcbkHHdpaRqUvD6",
    "note": "Recent trends in this field address several major aspects such as the online monitoring of the flight performances based on behavioral, physiological, and neurological measurements, the design of more ecological human-machine interfaces providing intuitive information about the flight or mission status to support decision process, and architecture rules that guarantee a high level of operation safety. The conference addresses a wide spectrum of theoretical and practical topics related to neuroergonomics and human factors, artificial intelligence or systems engineering. It is mainly focused on aeronautics but contributions from a wide range of domains such as automotive, robots, drones, or artificial agents are welcome."
  },
  {
    "shortName": "ARSO",
    "name": "IEEE International Conference on Advanced Robotics and Its Social Impacts",
    "start": "2024-05-20",
    "end": "2024-05-22",
    "deadline": "2024-01-31",
    "city": "Hong Kong",
    "country": "Hong Kong",
    "link": "https://ieee-arso.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/Q147cFZyYYQMnwvR6",
    "note": "Advanced robots are expected to enter in promising applications in our future society and bring substantial impacts. The increasing implementation of AI-based components even broadens their fields of application. To ensure that these impacts are positively reflected, today, we need to extend views not only on technical aspects but also on social challenges that we might face, which include safety, regulation, ethics, human factors, and philosophy."
  },
  {
    "shortName": "ICDL",
    "name": "IEEE International Conference on Development and Learning",
    "start": "2024-05-20",
    "end": "2024-05-23",
    "deadline": "2024-01-08",
    "city": "Austin, TX",
    "country": "USA",
    "link": "https://la.utexas.edu/users/dil/ICDL_Austin_2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/YjNhrqDz6iX7dVLV7",
    "note": "The IEEE International Conference on Development and Learning (ICDL) conference is a unique meeting gathering researchers from computer science, robotics, psychology, neuroscience, and other disciplines to share and discuss research on how humans and other animals learn and develop and how this can inform and be informed by robotics and machine learning systems."
  },
  {
    "shortName": "PlanRob",
    "name": "Twelfth ICAPS Workshop on Planning and Robotics",
    "start": "2024-06-02",
    "end": "2024-06-03",
    "deadline": "2024-03-25",
    "city": "Banff",
    "country": "Canada",
    "link": "https://icaps24.icaps-conference.org/program/workshops/planrob/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/qpKEpR7hRWStCr356",
    "note": "AI Planning & Scheduling (P&S) methods are key to enabling intelligent robots to perform autonomous, flexible, and interactive behaviours. Researchers in the P&S community have continued to develop approaches and produce planners, representations, as well as heuristics that robotics researchers can make use of. However, there remain numerous challenges complicating the uptake, use and successful integration of P&S technology in robotics, many of which have been addressed by robotics researchers with novel solutions."
  },
  {
    "shortName": "ISMR",
    "name": "International Symposium on Medical Robotics",
    "start": "2024-06-03",
    "end": "2024-06-05",
    "deadline": "2023-12-01",
    "city": "Atlanta",
    "country": "USA",
    "link": "https://www.ismr.gatech.edu/2024/2024-welcome",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/oF8rmsJz7CVmhvMq8",
    "note": "The goal of ISMR is to bring together world-class researchers to present state-of-the-art research achievements and advances in surgical robotics, image-guided interventions, rehabilitation and assistive robotics, as well as discuss challenges from the clinical point of view and address industry needs. It is envisioned that medical robots will integrate emerging technologies including soft robotics, smart materials, ergonomics, co-robotics, and artificial intelligence in the near future, and these topics will be featured in the symposium."
  },
  {
    "shortName": "ICUAS",
    "name": "International Conference on Unmanned Aircraft Systems",
    "start": "2024-06-04",
    "end": "2024-06-07",
    "deadline": "2024-02-11",
    "city": "Chania - Crete",
    "country": "Greece",
    "link": "https://uasconferences.com/2024_icuas/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/1wK899UaMTnsatj79",
    "note": "ICUAS focuses on civil and public domain applications and on the societal impact of unmanned aviation, and its effect on everyday quality of life."
  },
  {
    "shortName": "RAAD",
    "name": "International Conference on Robotics in Alpe-Adria-Danube Region",
    "start": "2024-06-05",
    "end": "2024-06-07",
    "deadline": "2023-12-20",
    "city": "Cluj-Napoca",
    "country": "Romania",
    "link": "https://raad.utcluj.ro/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/UNcZq5Rt3kp3wvc18",
    "note": "As is tradition, RAAD 2024 will cover all major areas of research, development and innovation in robotics, including new research trends such as: bioinspired and cognitive robots, visual servo control of robotic motions, human-robot interaction, cloud robotics and personal robots for ambient assisted living."
  },
  {
    "shortName": "MARTECH",
    "name": "The 11th International Workshop On Marine Technology",
    "start": "2024-06-06",
    "end": "2024-06-07",
    "deadline": "2023-12-10",
    "city": "Palma",
    "country": "Spain",
    "link": "https://sarti.webs.upc.edu/martech/index.php#intro",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/uzEtSGBpMti2eE8J8",
    "note": "Technological development deeply constrains our perception of marine environments and ecosystems. The main objective of the MARTECH Workshop is to share information and points of view on cutting-edge research in several fields of MARine TECHnology. MarTech is an internationally renewed venue for dissemination of marine technology research since 2008."
  },
  {
    "shortName": "MED",
    "name": "The 32nd Mediterranean Conference on Control and Automation",
    "start": "2024-06-11",
    "end": "2024-06-14",
    "deadline": "2024-02-01",
    "city": "Chania - Crete",
    "country": "Greece",
    "link": "https://www.med-control.org/med2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/rvyMhtGzk77wgLZG9",
    "note": "MED 2024 extends across four full days, and it is organized under the auspices of the Technical University of Crete. On June 11, the focus will be on Tutorials and Workshops, while the subsequent three days, June 12-14, will comprise the technical conference. Aligning with the current trend of merging control and systems theory with hardware/software and communication technologies, the conference will explore advancements in robotics and unmanned systems, autonomous systems, mechatronics, cyber-physical systems, and network-controlled systems. These topics of interest aim to foster collaboration between control and automation scientists and industry professionals."
  },
  {
    "shortName": "ICRAS",
    "name": "8th International Conference on Robotics and Automation Sciences",
    "start": "2024-06-21",
    "end": "2024-06-23",
    "deadline": "2024-03-10",
    "city": "Tokyo",
    "country": "Japan",
    "link": "http://www.icras.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/shcCu4vjAo288ubt9",
    "note": "The 8th International Conference on Robotics and Automation Sciences: AI-Powered Robotics Advancements (ICRAS 2024) will be held from June 21-23, 2024, in Tokyo, Japan. It sponsored by China University of Geosciences (Wuhan) and Beijing Institute of Control Robots and Intelligent Technology. ICRAS 2024 aims to gather professors, researchers, scholars, and industrial pioneers from all over the world to exchange past experiences, new advances, and research results in the field of theoretical and industrial experience. The conference welcomes contributions that promote the exchange of ideas and rational discourse between educators and researchers from all over the world."
  },
  {
    "shortName": "ReMAR",
    "name": "6th International Conference on Reconfigurable Mechanisms and Robots",
    "start": "2024-06-24",
    "end": "2024-06-26",
    "deadline": "2024-01-30",
    "city": "Chicago",
    "country": "USA",
    "link": "http://web.cvent.com/event/bd1bd184-001d-4395-b097-51389324c186/summary",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/W5gMPaLtDEj8Vx666",
    "note": "Following successful completion in London (2009), Tianjin (2012), Beijing (2015), Delft (2018), and Toronto (2021), the 6th IEEE/IFToMM International conference on Reconfigurable Mechanisms and Robots (ReMAR2024) will be held in Chicago, US, on June 24‐27, 2024. We aim at a highly inspiring event by bringing together researchers from a variety of research areas pertaining to reconfigurable mechanisms and robots."
  },
  {
    "shortName": "UR",
    "name": "International Conference on Ubiquitous Robots",
    "start": "2024-06-24",
    "end": "2024-06-27",
    "deadline": "2024-01-10",
    "city": "New York",
    "country": "USA",
    "link": "https://2024.ubiquitousrobots.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/77je5mnezqEy6rjn9",
    "note": "Since its inception in 2004, Ubiquitous Robots has now established itself as a leading mid-size robotics conference, bringing together robotics researchers from around the world who share the vision that robots, like mobile phones, will become ubiquitous in our daily lives, and help connect and empower humans"
  },
  {
    "shortName": "RCAR",
    "name": "IEEE International Conference on Real-time Computing and Robotics",
    "start": "2024-06-24",
    "end": "2024-06-28",
    "deadline": "2024-03-15",
    "city": "Ålesund",
    "country": "Norway",
    "link": "http://www.ieee-rcar.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/bTbbNvz7yj2ZJjxq7",
    "note": ""
  },
  {
    "shortName": "iSpaRo",
    "name": "International Conference on Space Robotics",
    "start": "2024-06-24",
    "end": "2024-06-27",
    "deadline": "2024-02-10",
    "city": "Luxembourg",
    "country": "Luxembourg",
    "link": "https://www.isparo.space/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/zBmcBVAaHB5Y6sQE7",
    "note": "The International Conference on Space Robotics (iSpaRo) is a new conference aiming to provide a framework for scientists and industry experts to engage in fruitful discussions and share their insights on the emerging topic of Space Robotics. In the last decade, the advances in in-orbit servicing and satellite operations, the renewed interest in the Moon, recent discoveries in the exploration of Mars and Near-Earth Asteroids (NEAs), together with the emergence of new ventures aimed at the prospection, extraction, and utilization of space resources have sparked a new wave of research and commercial opportunities. Traditional and new space companies are pushing the limits of in-space activities with robotics as the disruptive technology and enabler of the next advances in this new space era."
  },
  {
    "shortName": "EUROHAPTICS",
    "name": "Eurohaptics",
    "start": "2024-06-30",
    "end": "2024-07-03",
    "deadline": "2024-02-02",
    "city": "Lille",
    "country": "France",
    "link": "http://2024.eurohaptics.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/u2ypk9Xpxw58nYN17",
    "note": "We are excited to announce that this year, we are organizing a dedicated “Art/Design” track, providing a unique opportunity to explore the intersection of haptics with creativity and design. Furthermore, we are committed to strengthening our ties with industrial partners. Eurohaptics 2024 will feature job dating sessions and an industry forum, facilitating meaningful connections between academia and industry, and fostering collaborative opportunities that drive haptic technology forward."
  },
  {
    "shortName": "ARK",
    "name": "Advances in Robot Kinematics",
    "start": "2024-06-30",
    "end": "2024-07-04",
    "deadline": "2024-01-15",
    "city": "Ljubljana",
    "country": "Slovenia",
    "link": "https://ark2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/hyTLcxi4YkuATe9D7",
    "note": "ARK – Advances in Robot Kinematics is a boutique robotics international series of symposia. My first idea to organize a specialized conference on robot kinematics dates back to 1986. The initial supporters of this idea were scientists of the highest reputation, such as B. Roth, O. Khatib, K. Waldron, J. Angeles, V. Parenti-Castelli, M. McCarthy, M. Stanisic, B. Siciliano and others. At the first symposium, which I organized in Ljubljana in 1988, we agreed that we would organize ARK symposia every two years in the area of the Mediterranean and the Alps. So far, 18 symposia have been held. The proceedings are published in the form of edited books, which have been published by Springer (initially Kluwer) from the very beginning."
  },
  {
    "shortName": "WCCI",
    "name": "The IEEE World Congress on Computational Intelligence",
    "start": "2024-06-30",
    "end": "2024-07-05",
    "deadline": "2024-01-15",
    "city": "Yokohama",
    "country": "Japan",
    "link": "https://2024.ieeewcci.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/yszuyXNLtedtuZqV6",
    "note": "IEEE WCCI 2024 is the world’s largest technical event on computational intelligence, featuring the three flagship conferences of the IEEE Computational Intelligence Society (CIS) under one roof: The International Joint Conference on Neural Networks (IJCNN), the IEEE International Conference on Fuzzy Systems (FUZZ-IEEE) and the IEEE Congress on Evolutionary Computation (IEEE CEC)."
  },
  {
    "shortName": "CoDIT",
    "name": "10th International Conference on Control, Decision and Information Technologies",
    "start": "2024-07-01",
    "end": "2024-07-04",
    "deadline": "2024-02-03",
    "city": "Valetta",
    "country": "Malta",
    "link": "https://codit2024.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2B3g2HmRYDsZkBwYA",
    "note": "CoDIT 2024 will be held 01-04 July, 2024 at Valetta, Malta. Its purpose is to be a forum for technical exchange amongst scientists having interests in Control, Automation, Robotics, Optimization, Decision, Cybernetics, Computer Science and Information Technologies. This conference will provide a remarkable opportunity for the academic and industrial communities to address new challenges, share solutions and discuss future research directions. The technical program will include plenary lectures, regular technical sessions, and special sessions."
  },
  {
    "shortName": "MARSS",
    "name": "International Conference on Manipulation, Automation and Robotics at Small Scales",
    "start": "2024-07-01",
    "end": "2024-07-05",
    "deadline": "2024-03-31",
    "city": "Delft",
    "country": "Netherlands",
    "link": "http://marss-conference.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/zXk8u8HabCHHvtRVA",
    "note": "MARSS, the annual International Conference on Manipulation, Automation and Robotics at Small Scales, is a non-profit conference run by the microrobotic community and technically supported by IEEE-RAS and IEEE-NTC. MARSS2024 will be held in-person on July 01-05, 2024, in Delft, Netherlands. The conference is the flagship forum to discuss cross-disciplinary activities on 1) manipulation, automation, measurement, and characterization at micro/nano scales, and 2) all kinds of small-scale robots (nm – cm) and their applications."
  },
  {
    "shortName": "RoMoCo",
    "name": "International Workshop on Robot Motion and Control",
    "start": "2024-07-02",
    "end": "2024-07-04",
    "deadline": "2024-01-26",
    "city": "Poznań",
    "country": "Poland",
    "link": "http://romoco.put.poznan.pl/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/Y2iUaZheQbh2pNMq5",
    "note": ""
  },
  {
    "shortName": "ISAC",
    "name": "IEEE International Workshop on Interactive Systems and Affective Computing Technologies and Applications",
    "start": "2024-07-02",
    "end": "2024-07-04",
    "deadline": "2024-04-15",
    "city": "Osaka",
    "country": "Japan",
    "link": "https://ieeecompsac.computer.org/2024/isac/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/KnGPtWEJANED1TU1A",
    "note": "The scope of this workshop is to discuss the application and future possibilities of human computer interaction to be used for emotions, verbal / nonverbal expression, and recognition. Expression and recognition of emotions includes facial expressions, emotional data from biometric data from sensors, body motions, gestures, verbal, and nonverbal data."
  },
  {
    "shortName": "ICARM",
    "name": "International Conference on Advanced Robotics and Mechatronics",
    "start": "2024-07-06",
    "end": "2024-07-08",
    "deadline": "",
    "city": "Tokyo",
    "country": "Japan",
    "link": "http://www.ieee-arm.org/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "FUSION",
    "name": "International Conference on Information Fusion",
    "start": "2024-07-07",
    "end": "2024-07-11",
    "deadline": "2024-03-15",
    "city": "Venice",
    "country": "Italy",
    "link": "https://fusion2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/F8xhCPiLzAbRpCKo7",
    "note": "With the proliferation of sensor technology and ever-increasing amounts of data generated, Information Fusion is critical for combining noisy and possibly conflicting observations from various sensors and actors into actionable, coherent information about the underlying situation. The 27th International Conference on Information Fusion thus is soliciting papers from researchers and practitioners from academia, industry, and government agencies that explore traditional model-based and emerging data-driven autonomous methodologies on sensor, data, information and knowledge fusion, new system frameworks, hybrid processing techniques, and the associated challenges at the systemic level, including system design paradigms and issues of system control, management, test, and evaluation."
  },
  {
    "shortName": "LIVMACH",
    "name": "International Conference on Biomimetics and Biohybrid Systems",
    "start": "2024-07-08",
    "end": "2024-07-11",
    "deadline": "2024-04-12",
    "city": "Chicago",
    "country": "USA",
    "link": "https://livingmachinesconference.eu/2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/LdqrodW9sAcydUfA9",
    "note": "The development of future real-world technologies will depend strongly on our understanding and harnessing of the principles underlying living systems and the flow of communication signals between living and artificial systems. Biomimetics is the development of novel technologies through the distillation of principles from the study of biological systems. The investigation of biomimetic systems can serve two complementary goals. First, a suitably designed and configured biomimetic artifact can be used to test theories about the natural system of interest. Second, biomimetic technologies can provide useful, elegant, and efficient solutions to unsolved challenges in science and engineering."
  },
  {
    "shortName": "ICACR",
    "name": "8th International Conference on Automation, Control and Robots",
    "start": "2024-07-12",
    "end": "2024-07-14",
    "deadline": "",
    "city": "Xiangyang",
    "country": "China",
    "link": "http://www.icacr.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/XwEYGuDVZt2jGH3B9",
    "note": ""
  },
  {
    "shortName": "RSS",
    "name": "Robotics: Science and Systems",
    "start": "2024-07-15",
    "end": "2024-07-19",
    "deadline": "2024-02-02",
    "city": "Delft",
    "country": "Netherlands",
    "link": "https://roboticsconference.org/information/cfp/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/fnA8byTw2AwbY5Tq5",
    "note": "RSS is a single-track conference that connects researchers working on all aspects of robotics including scientific foundations, mechanisms, algorithms, applications, and analysis of robotic systems. The single-track format gives attendees an opportunity to learn about state-of-the-art research in all areas of robotics. The conference will consist of oral and poster presentations of accepted papers, demonstrations, invited talks, and panels."
  },
  {
    "shortName": "ISRE",
    "name": "International Society for Research on Emotion",
    "start": "2024-07-17",
    "end": "2024-07-20",
    "deadline": "2023-11-20",
    "city": "Belfast",
    "country": "Northen Ireland",
    "link": "https://www.isre2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/S7jp1PuvMuECLAna7",
    "note": "The ISRE conference is an exciting opportunity to meet international colleagues, present your work, and stay up-to-date with the latest developments in emotion research. ISRE members study emotions from a wide range of disciplines including affective computing, anthropology, art and design, education, history, linguistics, neuroscience, philosophy, psychology and sociology."
  },
  {
    "shortName": "AIM",
    "name": "IEEE/ASME International Conference on Advanced Intelligent Mechatronics",
    "start": "2024-07-15",
    "end": "2024-07-18",
    "deadline": "2024-02-08",
    "city": "Boston, MA",
    "country": "USA",
    "link": "https://www.aim2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/A9VhbfnwiaSVQifV7",
    "note": ""
  },
  {
    "shortName": "ACIRS",
    "name": "9th Asia-Pacific Conference on Intelligent Robot Systems",
    "start": "2024-07-18",
    "end": "2024-07-20",
    "deadline": "",
    "city": "Dalian",
    "country": "China",
    "link": "http://www.acirs.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/kJYbCJ5VhGZWFwxP8",
    "note": ""
  },
  {
    "shortName": "CACRE",
    "name": "9th International Conference on Automation, Control and Robotics Engineering",
    "start": "2024-07-18",
    "end": "2024-07-20",
    "deadline": "",
    "city": "Jeju",
    "country": "Korea (South)",
    "link": "http://cacre.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/p5he5veoAHcayWic7",
    "note": "The CACRE has been held for eight years since 2016, attracting scholars and students from all over the world. The CACRE 2024 conference will provide a wonderful forum for you to update your knowledge base and explore the innovations in Automation, Control and Robotics Engineering. The conference will strive to offer you plenty of networking opportunities to meet and interact with the leading scientists, engineers and researchers, friends and colleagues as well as sponsors and exhibitors."
  },
  {
    "shortName": "ICML",
    "name": "International Conference on Machine Learning",
    "start": "2024-07-19",
    "end": "2024-07-27",
    "deadline": "",
    "city": "Vienna",
    "country": "Austria",
    "link": "https://icml.cc/Conferences/FutureMeetings",
    "type": "Conference"
  },
  {
    "shortName": "COINS",
    "name": "IEEE International Conference on Omni-layer Intelligent Systems",
    "start": "2024-07-29",
    "end": "2024-07-31",
    "deadline": "2024-04-12",
    "city": "London",
    "country": "United Kingdom",
    "link": "http://coinsconf.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/hdknrz84vwTZwGo3A",
    "note": "Are you interested in taking part in shaping and adding new dimensions to the future IoT and AI ecosystem? are you seeking to harness the opportunities afforded by the tsunami of new technologies? Do you want to stay ahead and learn about the biggest digital technologies that are radically shifting the paradigm? or just curious about what IoT, AI, Big Data are all about and how they impact every aspect of our life, society, and business? IEEE COINS (https://coinsconf.com/) is the right place to be. IEEE COINS brings together experts in Digital Transformation (from AI and IoT to Cloud, Blockchain, Cybersecurity, and Robotics) from around the globe. IEEE COINS includes a multi-disciplinary program from technical research papers, to panels, workshops, and tutorials on the latest technology developments and innovations addressing all important aspects of the IoT & AI ecosystem."
  },
  {
    "shortName": "ICRES",
    "name": "International Conference Series on Robot Ethics and Standards",
    "start": "2024-07-29",
    "end": "2024-07-31",
    "deadline": "2024-04-01",
    "city": "Yokohama",
    "country": "Japan",
    "link": "https://clawar.org/icres2024/",
    "type": "Conference",
    "addressLink": "",
    "note": " The conference will be organized in collaboration with the Keio University, Japan, during 29-31, July 2024. The ICRES conference series provides a multidisciplinary forum for discussing the fundamental and pressing safety, ethical, legal, and societal issues in Artificial Intelligence and Robotics, and the scope is not limited to physical robots."
  },
  {
    "shortName": "ICMA",
    "name": "IEEE International Conference on Mechatronics and Automation",
    "start": "2024-08-04",
    "end": "2024-08-07",
    "deadline": "2024-04-10",
    "city": "Tianjin",
    "country": "China",
    "link": "http://2024.ieee-icma.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/5s8CKMbtE8mv9XUGA",
    "note": ""
  },
  {
    "shortName": "IRCE",
    "name": "7th International Conference on Intelligent Robotics and Control Engineering",
    "start": "2024-08-07",
    "end": "2024-08-09",
    "deadline": "",
    "city": "Xi'an",
    "country": "China",
    "link": "http://www.irce.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/PmguHZ6yU9uE66b47",
    "note": ""
  },
  {
    "shortName": "CIS-RAM",
    "name": "IEEE International Conference on Cybernetics and Intelligent Systems and IEEE International Conference on Robotics, Automation and Mechatronics",
    "start": "2024-08-08",
    "end": "2024-08-11",
    "deadline": "2024-03-08",
    "city": "Hangzhou",
    "country": "China",
    "link": "https://www.cis-ram.org/2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/DhiNRLwY8b8h1Zad8",
    "note": "The IEEE International Conferences on CIS & RAM have always been held together, to exploit the synergistic relationship between both areas"
  },
  {
    "shortName": "ICOM",
    "name": "9th International Conference on Mechatronics Engineering",
    "start": "2024-08-13",
    "end": "2024-08-14",
    "deadline": "",
    "city": "Kuala Lumpur",
    "country": "Malaysia",
    "link": "http://conference.iium.edu.my/icom/index.php/home/",
    "type": "Conference",
    "addressLink": "",
    "note": "The 9th International Conference on Mechatronics Engineering (ICOM’24) is a series of conference organized by the Kulliyyah of Engineering, International Islamic University Malaysia (IIUM) and Mechatronics Engineering Department, as a part of IIUM Engineering Congress (IEC) 2024. ICOM ’24 focuses on bringing together researchers, experts and practitioners to address the latest trends and technologies in the multifaceted field of Mechatronics Engineering"
  },
  {
    "shortName": "RP",
    "name": "Robophilosophy Conference",
    "start": "2024-08-20",
    "end": "2024-08-23",
    "deadline": "2024-02-15",
    "city": "Aarhus",
    "country": "Denmark",
    "link": "https://cas.au.dk/en/robophilosophy/conferences/rpc2024",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/h14yvWGgm6Zwxpgc6",
    "note": "The aim of the international research conference RP2024 is to address the deep and far-reaching questions raised by recent advances in AI on the basis of the required research expertise.  RP2024 will  bring together international researchers from all relevant disciplines, from social robotics and AI research, but especially also from Humanities and social science research in HRI (Human-Robot Interact research). The special ambition of RP2024 is to produce actionable knowledge based on professional engagement of the foundational issues—only in this fashion we can move beyond well-intentioned proclamations and address the expectable socio-cultural transformations of societies by social robotics in a responsible fashion"
  },
  {
    "shortName": "IMVIP",
    "name": "Irish Machine Vision and Image Processing Conference",
    "start": "2024-08-21",
    "end": "2024-08-23",
    "deadline": "2024-05-22",
    "city": "Limerick",
    "country": "Ireland",
    "link": "https://www.imvip.ie/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/SEo8QaHX9KRgv3FY8",
    "note": "The Irish Machine Vision and Image Processing Conference (IMVIP) Conference is the annual research conference of the Irish Pattern Recognition and Classification Society. The chief objective of the society is the advancement of research and study of pattern recognition, classification and associated fields and the applications of the outcomes of research. IPRCS is a member of the International Association for Pattern Recognition (IAPR) and the International Federation of Classification Societies."
  },
  {
    "shortName": "ROMAN",
    "name": "IEEE International Conference on Robot and Human Interactive Communication",
    "start": "2024-08-26",
    "end": "2024-08-30",
    "deadline": "2024-03-24",
    "city": "Pasadena, CA",
    "country": "USA",
    "link": "https://www.ro-man2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/D646QunkfhL3yDWR7",
    "note": "With the continuous technological effort of understanding human needs, creating human-desired robotic systems, and developing real human user experiences, we are marching together towards building a promising and excellent human quality of life, all for our wellness and our next generation. The conference provides a forum for researchers and practitioners to discuss a variety of topics related to the broad theme of Robot and Human Interactive Communication involving theories, methodologies, technologies, empirical and experimental studies, and generate more insights for the future of Robot and Human Interactive Communication!"
  },
  {
    "shortName": "MMAR",
    "name": "28th International Conference on Methods and Models in Automation and Robotics",
    "start": "2024-08-27",
    "end": "2024-08-30",
    "deadline": "2024-03-04",
    "city": "Miedzyzdroje",
    "country": "Poland",
    "link": "http://www.mmar.edu.pl",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/FtqULC6GZnZgJCAQ9",
    "note": "The participants of the 28th International MMAR Conference will have the opportunity to take part in the wide spectrum of categories for technical presentations, including plenary lectures, regular papers of both lecture and poster session types. We look forward to seeing our old and new friends in Poland. You are kindly invited to participate in the 28th International MMAR Conference in Miedzyzdroje, Poland."
  },
  {
    "shortName": "ICAC",
    "name": "29th International Conference on Automation and Computing",
    "start": "2024-08-28",
    "end": "2024-08-30",
    "deadline": "",
    "city": "Sunderland",
    "country": "United Kingdom",
    "link": "http://www.cacsuk.co.uk/index.php/conferences",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/h6EYEBh1r8iMUJoNA",
    "note": ""
  },
  {
    "shortName": "CASE",
    "name": "IEEE International Conference on Automation Science and Engineering",
    "start": "2024-08-28",
    "end": "2024-09-01",
    "deadline": "2024-03-25",
    "city": "Bari",
    "country": "Italy",
    "link": "https://www.case2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/7yTbw63uFQgKmW5A6",
    "note": "The conference will focus on Automation 5.0: automation everywhere for better and smarter living and will include tutorials and workshops, a technical program of presentations, keynote lectures, and social events. The conference will cover a wide range of topics on Systems, Automation, Control theory, Autonomous Systems, Discrete Event Systems, Smart Cities, Robotics, Building Automation, Smart Mobility, Information and Communication Technologies, and Factory 4.0."
  },
  {
    "shortName": "BioRob",
    "name": "IEEE EMB International Conference on Biomedical Robotics and Biomechatronics",
    "start": "2024-09-01",
    "end": "2024-09-04",
    "deadline": "2024-01-31",
    "city": "Heidelberg",
    "country": "Germany",
    "link": "https://www.biorob2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/8ttKQK215bK97j4e7",
    "note": "BioRob delves into both theoretical and practical challenges arising from the integration of robotics and mechatronics into medicine and biology. The main objective of Biorobotics is to evaluate biological systems through a 'biomechatronic' lens, striving to unravel the scientific and engineering principles that underpin their exceptional performance. This deep comprehension of biological system functions, behaviors, and interactions serves two primary purposes: to inform the design and creation of new, high-performance bio-inspired machinery and systems for various applications, and to foster the development of innovative nano-, micro-, and macro-devices that can act upon, replace, or assist human beings in areas such as disease prevention, diagnostics, surgical procedures, prosthetics, rehabilitation, and personal assistance."
  },
  {
    "shortName": "MESA",
    "name": "IEEE/ASME International Conference on Mechatronic, Embedded Systems and Applications",
    "start": "2024-09-02",
    "end": "2024-09-04",
    "deadline": "2024-04-15",
    "city": "Genova",
    "country": "Italy",
    "link": "https://mesa2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/cLWXpspJGBdCDT7Y7",
    "note": "The goal of the 20th ASME/IEEE MESA 2024 is to bring together experts from the fields of mechatronic and embedded systems, disseminate the recent advances in the area, discuss future research directions, and exchange application experience. MESA 2024 will especially bring out and highlight the latest research results and developments in Industry 4.0 and Artificial Intelligence (AI) in the fields of mechatronics and embedded systems."
  },
  {
    "shortName": "CAMS",
    "name": "IFAC Conference on Control Applications in Marine Systems, Robotics and Vehicles",
    "start": "2024-09-03",
    "end": "2024-09-05",
    "deadline": "2024-01-22",
    "city": "Blacksburg, VA",
    "country": "USA",
    "link": "https://ifac-cams2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ejfgFYNhpvonNuU6A",
    "note": "Virginia Tech and the IFAC Technical Committee in Marine Systems welcome you to the 15th IFAC Conference on Control Applications in Marine Systems, Robotics and Vehicles. The conference aims at defining the research, development and innovation agenda within the areas of marine  automation, control and robotics bridging the prominent views of academia and industry."
  },
  {
    "shortName": "CLAWAR",
    "name": "International Conference Series on Climbing and Walking Robots",
    "start": "2024-09-04",
    "end": "2024-09-06",
    "deadline": "2024-04-15",
    "city": "Kaiserslautern",
    "country": "Germany",
    "link": "https://clawar.org/clawar24/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Sp3stMvqQyAkCipT8",
    "note": "The CLAWAR 2024 aims to strengthen the scientific and personal exchange in the walking robotics community. Original contributions are invited in the area of climbing and walking robots as well as in general mobile robotics like flying and ground robots."
  },
  {
    "shortName": "INISTA",
    "name": "IEEE International Conference on INnovations in Intelligent SysTems and Applications",
    "start": "2024-09-04",
    "end": "2024-09-06",
    "deadline": "2024-04-25",
    "city": "Craiova",
    "country": "Romania",
    "link": "https://dcti.ucv.ro/inista2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/zobD5mETNQkPhsJ66",
    "note": "International Conference on INnovations in Intelligent SysTems and Applications (INISTA) has been organized since 2005. It aims to bring together the researchers from the entire spectrum of the multi-disciplinary fields of intelligent systems and to establish effective means of communication between them. In particular, it focuses on all aspects of intelligent systems and the related applications, from the points of view of both theory and practice. Apart of the main track it includes work-shops, tutorials, special sessions and plenary talks by invited speakers."
  },
  {
    "shortName": "ANTS",
    "name": "International Conference on Swarm Intelligence",
    "start": "2024-09-09",
    "end": "2024-09-11",
    "deadline": "2023-04-07",
    "city": "Konstanz",
    "country": "Germany",
    "link": "https://www.uni-konstanz.de/ants-2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/9WUTob8byHA65t1E6",
    "note": "Swarm intelligence is the discipline that deals with the study of self-organizing processes both in nature and in artificial systems. Researchers in ethology and animal behavior have proposed a number of models to explain interesting aspects of collective behaviors such as movement coordination, shape-formation or decision making. Recently, algorithms and methods inspired by these models have been proposed to solve difficult problems in many domains. ANTS 2024 will give researchers in swarm intelligence the opportunity to meet, to present their latest research, and to discuss current developments and applications."
  },
  {
    "shortName": "SAB",
    "name": "International Conference on Simulation of Adaptive Behavior",
    "start": "2024-09-09",
    "end": "2024-09-12",
    "deadline": "2023-04-01",
    "city": "Irvine CA",
    "country": "USA",
    "link": "https://sites.uci.edu/sab2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/VXeTcdk3SSZfzRHB7",
    "note": "The Simulation of Adaptive Behavior (SAB) interdisciplinary conference brings together researchers in artificial intelligence, artificial life, computer science, cybernetics, ethology, evolutionary biology, neuroscience, robotics, and many other fields, to further our understanding of the behaviors and underlying mechanisms that allow natural animals and artificial agents to adapt and survive in complex, dynamic and uncertain environments. Animats denote the connection between animals and synthetic agents. The conference focuses on models and experiments designed to help characterize and compare various organizational principles and architectures underlying adaptive behavior in real animals and in animats."
  },
  {
    "shortName": "WIVACE",
    "name": "International Workshop on Artificial Life and Evolutionary Computation",
    "start": "2024-09-11",
    "end": "2024-09-13",
    "deadline": "2024-06-07",
    "city": "Namur",
    "country": "Belgium",
    "link": "https://events.info.unamur.be/wivace2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/Ds8rgdMB69Fb9a8j6",
    "note": "The International Workshop on Artificial Life and Evolutionary Computation aims at bringing together researchers to present and share their results and ideas in a multidisciplinary context. The workshop provides a forum for the discussion of new research directions and applications in Artificial Life, Evolutionary Computation and in related fields, where different disciplines and research areas could effectively meet."
  },
  {
    "shortName": "CRAS",
    "name": "Conference on New Technologies for Computer and Robot Assisted Surgery",
    "start": "2024-09-11",
    "end": "2024-09-13",
    "deadline": "2024-05-15",
    "city": "Odense",
    "country": "Denmark",
    "link": "https://cras-eu.org/cras-2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ELQYB17Em6Jec7ur9",
    "note": "In this 13th edition, communications are expected to relate advances in the following fields: Advanced Computer-Assisted Surgery Systems, Robotic Platforms and Systems for Surgical Procedures, Sensing and Imaging Technologies in Surgery, AI and Machine Learning Applications for Surgical Autonomation, Surgical Simulation and Training Tools."
  },
  {
    "shortName": "IVA",
    "name": "ACM 24th International Conference on Intelligent Virtual Agents ",
    "start": "2024-09-16",
    "end": "2024-09-19",
    "deadline": "2024-04-05",
    "city": "Glasgow",
    "country": "Scotland",
    "link": "https://iva.acm.org/2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/a7kZY8VJW4tj6Vdo6",
    "note": "The annual conference on Intelligent Virtual Agents (IVA) is the premier international event for interdisciplinary research on the design, application, and evaluation of Intelligent Virtual Agents (IVAs) with a specific focus on the ability to socially interact. IVAs are interactive characters that exhibit human-like qualities including communicating using natural human modalities such as facial expressions, speech, and gesture. They are capable of real-time perception, cognition, emotion and action that allow them to participate in dynamic social environments."
  },
  {
    "shortName": "ICMRA",
    "name": "7th International Conference on Mechatronics, Robotics and Automation",
    "start": "2024-09-20",
    "end": "2024-09-22",
    "deadline": "",
    "city": "Wuhan",
    "country": "China",
    "link": "http://www.icmra.org/index.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/KAE2kgsrnPAYYuJh8",
    "note": ""
  },
  {
    "shortName": "ICRA@40",
    "name": "40th Anniversary of the IEEE Conference on Robotics and Automation",
    "start": "2024-09-23",
    "end": "2024-09-26",
    "deadline": "2024-05-31",
    "city": "Rotterdam",
    "country": "Netherlands",
    "link": "https://icra40.ieee.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/mqkgyP2LFwpzGh3i9",
    "note": "Join us at ICRA@40 for a special commemorative edition marking the 40th anniversary of the ICRA Conference, honoring four decades of groundbreaking research and innovation in robotics and automation.  ICRA@40 is a four-day SINGLE-TRACK conference featuring plenary sessions, distinguished talks and debate panels to explore the past and envision the future, by the most renowned academics and industry experts in robotics and automation. Enjoy ICRA@40 industry-focused day, dedicated to unveiling cutting-edge advancements and technological breakthroughs, stimulating panels, a bustling job fair and vibrant startup showcases."
  },
  {
    "shortName": "IROS",
    "name": "IEEE/RSJ International Conference on Intelligent Robots and Systems",
    "start": "2024-10-14",
    "end": "2024-10-18",
    "deadline": "2024-03-15",
    "city": "Abu Dhabi",
    "country": "United Arab Emirates",
    "link": "https://iros2024-abudhabi.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/9D28AzaeTXWeu8an9",
    "note": "IROS is one of the largest and most important robotics research conferences in the world, attracting researchers, academics, and industry professionals from around the globe. Established in 1988, IROS provides a platform for the international robotics community to exchange knowledge and ideas about the latest advances in intelligent robots and smart machines."
  },
  {
    "shortName": "ROSCON",
    "name": "ROS Conference",
    "start": "2024-10-21",
    "end": "2024-10-23",
    "deadline": "2024-05-03",
    "city": "Odense",
    "country": "Denmark",
    "link": "https://roscon.ros.org/2024/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/SHCx49AvLktAPzd27",
    "note": "ROSCon is a developers conference, in the model of PyCon and BoostCon. Following the success of our past events, this year’s ROSCon will be our thirteenth ROSCon and held in Odense, Denmark. Similar to previous years, the two-day program will comprise of technical talks and tutorials that will introduce you to new tools and libraries, as well as teach you more about the ones you already know. The bulk of the program will be 10-30 minute presentations (some may be longer or shorter) along with panel discussions, lightning talks, demonstrations, and workshops."
  },
  {
    "shortName": "ICSR",
    "name": "International Conference on Social Robotics",
    "start": "2024-10-23",
    "end": "2024-10-26",
    "deadline": "2024-07-05",
    "city": "Odense",
    "country": "Denmark",
    "link": "https://icsr2024.dk/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/ohCPHAJPZkjCaVvg9",
    "note": "The 16th International Conference on Social Robotics will bring together researchers and practitioners working on the interaction between humans and intelligent robots and on the integration of social robots into our society. ICSR’24 will take place in Odense, Denmark as a face-to-face conference between October 23-26, 2024. This will be the first time that the conference will be hosted in Denmark and Scandinavia. The theme of this year’s conference is “Empowering Humanity: The Role of Social and Collaborative Robotics in Shaping Our Future”."
  },
  {
    "shortName": "DARS",
    "name": "International Symposium on Distributed Autonomous Robotic Systems",
    "start": "2024-10-28",
    "end": "2024-10-30",
    "deadline": "2024-03-31",
    "city": "New York",
    "country": "USA",
    "link": "https://dars2024.engineering.cornell.edu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/BaMogUz2679vaXry8",
    "note": "Due to rapid advances in manufacturing, computing, and communication, distributed robotics is a rapidly growing area in robotics.  This field draws on knowledge across a large range of disciplines such as computer science, communication and control systems, electrical and mechanical engineering, life sciences, and humanities. DARS 2024 will provide an exciting opportunity for researchers to present and discuss the latest advances in distributed robotic technologies, algorithms, system architectures, and applications."
  },
  {
    "shortName": "ROBOT",
    "name": "7th Iberian Robotics Conference",
    "start": "2024-11-06",
    "end": "2024-11-08",
    "deadline": "2024-07-13",
    "city": "Madrid",
    "country": "Spain",
    "link": "https://eventos.upm.es/109808/section/49651/robot-2024-.html",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/bDfQ7PJiaPxGVcsP7",
    "note": "We are pleased to announce the Seventh Iberian Robotics Conference, to be held at the Universidad Politécnica de Madrid from November 6 to 8, 2024. This conference is a premier platform for researchers and professionals to exchange ideas and advancements in various robotics-related areas. We invite authors to submit original contributions across all robotics domains, covering industrial robots, autonomous systems, and field and service robots. The conference will discuss modelling and simulation techniques, design methodologies, and practical applications of developed robotic systems. Additionally, we welcome submissions on support technologies integral to robotic systems' realisation, including sensors and actuators, computer vision and image processing, tactile and haptic devices, control algorithms and architectures, localisation, mapping, navigation, artificial intelligence techniques, and associated economic, ethical, legal, and social considerations. Of particular interest is the exploration of human-robot interaction, which encompasses personal and social robots, medical robots, and exoskeletons, representing an increasingly active and crucial area."
  },
  {
    "shortName": "CoRL",
    "name": "Conference on Robot Learning",
    "start": "2024-11-06",
    "end": "2024-11-09",
    "deadline": "2024-06-06",
    "city": "Munich",
    "country": "Germany",
    "link": "https://www.corl.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/DkjbJ4juqUVE3S1s5",
    "note": ""
  },
  {
    "shortName": "ICECCME",
    "name": "International Conference on Electrical, Computer, Communications and Mechatronics Engineering",
    "start": "2024-11-11",
    "end": "2024-11-13",
    "deadline": "2024-06-09",
    "city": "Malé",
    "country": "Maldives",
    "link": "http://www.iceccme.com/home",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/9QC9CFPjirStvzxg8",
    "note": "The 4th International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME) is the premier event that brings together industry professionals, academics, and engineers from the related institutions to exchange information and ideas on electrical, computer, communications and mechatronic engineering. The conference will feature a comprehensive technical program offering numerous technical sessions with papers showcasing the latest technologies, and applications."
  },
  {
    "shortName": "LARS",
    "name": "IEEE Latin American Robotics Symposium",
    "start": "2024-11-11",
    "end": "2024-11-13",
    "deadline": "2024-06-10",
    "city": "Arequipa",
    "country": "Peru",
    "link": "https://lars-larc2024.ucsp.edu.pe/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/8RQfSQNANRPs9Gu98",
    "note": "Latin American Robotics Symposium - LARS and Latin American Robotics Competition - LARC are the most important academic events in robotics in all Latin America. Every year LARS/LARC takes place in a Latin American Country. This is a Latin-American event that brings together several sub-events that aim to encourage research and development in the area of Robotics."
  },
  {
    "shortName": "i-SAIRAS",
    "name": "International Symposium on Artificial Intelligence, Robotics and Automation in Space",
    "start": "2024-11-19",
    "end": "2024-11-21",
    "deadline": "2024-06-03",
    "city": "Brisbane",
    "country": "Australia",
    "link": "https://www.isairas2024.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/K4Ka8tKSCdXQPkE8A",
    "note": "i-SAIRAS is an exciting biennial event that brings together the international space community to explore the latest advances in artificial intelligence, robotics, and automation. The Symposia are led by the Canadian Space Agency (CSA-ASC), the German Aerospace Agency (DLR), the European Space Agency (ESA), the Japanese Aerospace Exploration Agency (JAXA), and the National Aerospace Administration (NASA).  The Symposia provide an ideal platform for agencies, researchers, and industry professionals engaged in the fields of AI, robotics, and space exploration, seeking to share knowledge, foster collaborations, and shape the future of space technology.​"
  },
  {
    "shortName": "CBS",
    "name": "IEEE International Conference on Cyborg and Bionic Systems",
    "start": "2024-11-20",
    "end": "2024-11-22",
    "deadline": "2024-05-31",
    "city": "Nagoya",
    "country": "Japan",
    "link": "http://cbs-2024.com/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/mYZs6auk5H1BhZ17A",
    "note": "The 2024 IEEE International Conference on Cyborg and Bionic Systems (CBS 2024) will be held in 20-22, November, 2024 in Nagoya, Japan. Consistent with our theme, we have arranged plenary keynotes from leading industrial and academic scientists, who will give forward looking visions as well as historical perspectives on our field. A broad array of scientific tracks will cover diverse topics of cutting-edge research and innovation on cyborg and bionic systems, which are concerned with hybrid fusion of organic and biomechatronic body parts with the integration of some artificial components or technology like bio-hybrid actuators and sensors. In addition to the high-profile keynotes, the conference program will feature invited sessions, oral and poster sessions, sessions for students and young professions, sessions for clinicians and entrepreneurs, and exhibits from vendors and universities."
  },
  {
    "shortName": "Humanoids",
    "name": "IEEE-RAS International Conference on Humanoid Robots",
    "start": "2024-11-22",
    "end": "2024-11-24",
    "deadline": "2024-07-01",
    "city": "Nancy",
    "country": "France",
    "link": "https://2024.ieee-humanoids.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/hXQYxidVc6n8PGq59",
    "note": ""
  },
  {
    "shortName": "EuroXR",
    "name": "21st EuroXR International Conference",
    "start": "2024-11-27",
    "end": "2024-11-29",
    "deadline": "2024-05-06",
    "city": "Athens",
    "country": "Greece",
    "link": "https://www.euroxr.org/conference-2024",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/VVcGbHYKy9q6wwSx7",
    "note": "Join us at the 21st EuroXR International Conference (EuroXR 2024), the ultimate gathering for Virtual Reality (VR), Augmented Reality (AR), and Mixed Reality (MR) held in Athens, Greece, from 27th to 29th November 2024.  This year co-organized by the Institute of Communication and Computer System (ICCS). "
  },
  {
    "shortName": "ICFES",
    "name": "International Conference on Flexible Electronics and Systems",
    "start": "2024-12-12",
    "end": "2024-12-14",
    "deadline": "",
    "city": "Hong Kong",
    "country": "China",
    "link": "http://www.ieee-icfes.org/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  }
]