[
  {
    "shortName": "HICSS",
    "name": "Hawaii International Conference on System Sciences",
    "start": "2024-01-03",
    "end": "2024-01-06",
    "deadline": "2023-06-15",
    "city": "Honolulu",
    "country": "USA",
    "link": "https://hicss.hawaii.edu/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/GiqEzTTRmBpDxnX37",
    "note": ""
  },
  {
    "shortName": "SII",
    "name": "IEEE/SICE International Symposium on System Integration",
    "start": "2024-01-08",
    "end": "2024-01-11",
    "deadline": "2023-08-01",
    "city": "Ha Long",
    "country": "Vietnam",
    "link": "https://sice-si.org/SII2024/index.html",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/5GzgJAFqasP3WsneA",
    "note": ""
  },
  {
    "shortName": "HRI",
    "name": "ACM/IEEE International Conference on Human-Robot Interaction",
    "start": "2024-03-11",
    "end": "2024-03-14",
    "deadline": "2023-09-29",
    "city": "Boulder",
    "country": "USA",
    "link": "https://humanrobotinteraction.org/2024/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/V38Us98mFmTaW41w9",
    "note": "The conference theme for HRI 2024 is HRI in the real world and will focus on key HRI theories, designs, studies, systems, and technical advances that aim to bring HRI out of the lab and into everyday life. We encourage the community to consider what it means to do HRI in practice, and ways to bring it into the mainstream."
  },
  {
    "shortName": "SAC-IRMAS",
    "name": "ACM/SIGAPP Symposium On Applied Computing - Track Intelligent Robotics and Multi-Agent Systems",
    "start": "2024-04-08",
    "end": "2024-04-12",
    "deadline": "2023-09-15",
    "city": "Avila",
    "country": "Spain",
    "link": "https://sac2024-irmas.isr.uc.pt/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/MTdd6bGNmjGNjczP9",
    "note": "Robotics is a multidisciplinary research area that presents an enormous potential. It concerns about developing intelligent robotic systems that are capable of making decisions and acting autonomously in real and unpredictable environments to accomplish tasks and assist humans in relevant application domains for society. Several complex problems require the use of teams of robots that share some of the same challenges studied in MAS."
  },
  {
    "shortName": "SEAMS",
    "name": "International Conference on Software Engineering for Adaptive and Self-Managing Systems",
    "start": "2024-04-15",
    "end": "2024-04-16",
    "deadline": "2023-10-06",
    "city": "Lisbon",
    "country": "Portugal",
    "link": "https://conf.researchr.org/home/seams-2024",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/d7rFdhuN2cVLL1nE9",
    "note": "SEAMS is a CORE-A ranked conference that applies software engineering methods, techniques, processes, and tools to support the construction of safe, performant, and cost-effective self-adaptive and autonomous systems that provide self-* properties like self-configuration, self-healing, self-optimization, and self-protection."
  },
  {
    "shortName": "ARK",
    "name": "Advances in Robot Kinematics",
    "start": "2024-06-30",
    "end": "2024-07-04",
    "deadline": "2023-01-15",
    "city": "Ljubljana",
    "country": "Slovenia",
    "link": "https://ark2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/hyTLcxi4YkuATe9D7",
    "note": "ARK – Advances in Robot Kinematics is a boutique robotics international series of symposia. My first idea to organize a specialized conference on robot kinematics dates back to 1986. The initial supporters of this idea were scientists of the highest reputation, such as B. Roth, O. Khatib, K. Waldron, J. Angeles, V. Parenti-Castelli, M. McCarthy, M. Stanisic, B. Siciliano and others. At the first symposium, which I organized in Ljubljana in 1988, we agreed that we would organize ARK symposia every two years in the area of the Mediterranean and the Alps. So far, 18 symposia have been held. The proceedings are published in the form of edited books, which have been published by Springer (initially Kluwer) from the very beginning."
  },
  {
    "shortName": "AIM",
    "name": "International Conference on Advanced Intelligent Mechatronics",
    "start": "2024-07-15",
    "end": "2024-07-28",
    "deadline": "2024-02-08",
    "city": "Boston",
    "country": "USA",
    "link": "https://www.aim2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/C4QuwDDT53EBwcdA8"
  },
  {
    "shortName": "ICML",
    "name": "International Conference on Machine Learning",
    "start": "2024-07-19",
    "end": "2024-07-27",
    "deadline": "",
    "city": "Vienna",
    "country": "Austria",
    "link": "https://icml.cc/Conferences/FutureMeetings",
    "type": "Conference"
  },
  {
    "shortName": "BioRob",
    "name": "IEEE EMB International Conference on Biomedical Robotics and Biomechatronics",
    "start": "2024-09-01",
    "end": "2024-09-04",
    "deadline": "2023-12-15",
    "city": "Heidelberg",
    "country": "Germany",
    "link": "https://www.biorob2024.org/",
    "type": "Conference",
    "addressLink": "https://goo.gl/maps/8ttKQK215bK97j4e7",
    "note": "BioRob delves into both theoretical and practical challenges arising from the integration of robotics and mechatronics into medicine and biology. The main objective of Biorobotics is to evaluate biological systems through a 'biomechatronic' lens, striving to unravel the scientific and engineering principles that underpin their exceptional performance. This deep comprehension of biological system functions, behaviors, and interactions serves two primary purposes: to inform the design and creation of new, high-performance bio-inspired machinery and systems for various applications, and to foster the development of innovative nano-, micro-, and macro-devices that can act upon, replace, or assist human beings in areas such as disease prevention, diagnostics, surgical procedures, prosthetics, rehabilitation, and personal assistance."
  }
]
