[
  {
    "shortName": "SII",
    "name": "International Conference on Gender and Technology",
    "start": "2025-01-16",
    "end": "2025-01-19",
    "deadline": "2024-08-30",
    "city": "Kerala",
    "country": "India",
    "link": "https://www.amrita.edu/events/gender-technology-conference-2025",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/waC6ZW7QMoRMGqQT7",
    "note": "The International Conference on Gender and Technology 2025 invites submissions for papers related to the intersection of gender with emerging technologies, e.g. Blockchain, AI, VR/mixed reality, IoT, and robotics, and how these have been enablers across the the following Thematic Areas"
  },
  {
    "shortName": "SII",
    "name": "IEEE/SICE International Symposium on System Integration",
    "start": "2025-01-21",
    "end": "2025-01-24",
    "deadline": "2024-09-31",
    "city": "Munich",
    "country": "Germany",
    "link": "https://www.sice-si.org/SII2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/dbFNcmNf1F6THNhC6",
    "note": "The 2025 IEEE/SICE International Symposium on System Integrations (SII 2025) will be the 17th symposium on system integration. System integration is one of the key technologies, and integrating hardware and software is especially important to solve the industrial or social system problems in the new century. This symposium focuses on the latest research and industrial application of system integration and discusses the approach method to improve the effectiveness of system integration."
  },
  {
    "shortName": "ICICIP",
    "name": "International Conference on Intelligent Control and Information Processing",
    "start": "2025-02-06",
    "end": "2025-02-11",
    "deadline": "2024-11-01",
    "city": "Muscat",
    "country": "Oman",
    "link": "https://conference.cs.cityu.edu.hk/icicip/",
    "type": "Conference",
    "addressLink": "",
    "note": "The 13th International Conference on Intelligent Control and Information Processing (ICICIP2025) will be held in Muscat, Oman, February 6-11, 2025, following the successes of previous events. As the capital of Oman, Muscat is Oman's largest city with a population of over four million people and numerous tourist attractions. ICICIP2025 aims to provide a high-level international forum for scientists, engineers, and educators to present the state of the art of research and applications in related fields. The conference will feature plenary speeches given by world-renowned scholars, regular sessions with broad coverage, special sessions focusing on popular topics, and post-conference workshops/tutorials in the region."
  },
  {
    "shortName": "HRI",
    "name": "ACM/IEEE International Conference on Human-Robot Interaction",
    "start": "2025-03-04",
    "end": "2025-03-06",
    "deadline": "2024-09-24",
    "city": "Melbourne",
    "country": "Australia",
    "link": "https://humanrobotinteraction.org/2025/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/CLHqNRCiybSaYFdDA",
    "note": "We are excited to announce the 20th Annual ACM/IEEE International Conference on Human Robot Interaction (HRI). HRI is the annual conference for basic and applied HRI research, where researchers from across the world present their best work to exchange ideas about theory, technology, data, and science furthering the state-of-the-art in the field."
  },
  {
    "shortName": "ERF",
    "name": "European Robotics Forum",
    "start": "2025-03-25",
    "end": "2025-03-27",
    "deadline": "2024-09-30",
    "city": "Stuttgart",
    "country": "Germany",
    "link": "https://erf2025.eu/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/YBkSPh9fq3MkFU8r5",
    "note": "Participants will have the opportunity to explore industrial institutions as well as Fraunhofer Institutes, the University of Stuttgart, Cyber Valley, and the Max Planck Institute for Intelligent Systems. These visits will offer valuable insights into pioneering research and market-ready applications. Stuttgart's automotive heritage has fostered an exceptional ecosystem of automation suppliers. The convergence of academia, research institutions, and industry presents a unique opportunity for collaboration and the exploration of innovative solutions. With over 1,000 industrial projects each year, the Fraunhofer Institute for Manufacturing Engineering and Automation IPA serves as a perfect base for attracting sponsors and delegates beyond euRobotics. We anticipate a significant increase in both sponsorship support and the number of delegates. We are curating a series of site visits to renowned robotic end-users and technology providers."
  },
  {
    "shortName": "ICMRACC",
    "name": "IEEE 1st International Conference on Materials, Robotics & Automation, Computer and Control",
    "start": "2025-03-14",
    "end": "2025-03-16",
    "deadline": "",
    "city": "Kannur",
    "country": "India",
    "link": "",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "CIES",
    "name": "IEEE Symposium on Computational Intelligence in in Engineering/Cyber Physical Systems",
    "start": "2025-03-17",
    "end": "2025-03-20",
    "deadline": "2025-09-17",
    "city": "Trondheim",
    "country": "Norway",
    "link": "https://ieee-ssci.org/?ui=ci-in-engineering-cyber-physical-systems",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/3W7DnSoM811cRKt5A",
    "note": "This symposium aims to serve as a leading forum for researchers, technologists, and industry experts to exchange ideas, share advancements, and shape the future of this interdisciplinary field. Indeed, the fusion of CI with engineering and CPS is revolutionizing the way we interact with our physical world, making systems smarter, more efficient, and more adaptive. The application of CI and machine learning (ML) in these domains is not just enhancing existing technologies but is also paving the way for novel paradigms in design, operation, and services."
  },
  {
    "shortName": "SEAMS",
    "name": "International Conference on Software Engineering for Adaptive and Self-Managing Systems",
    "start": "2025-04-26",
    "end": "2025-05-04",
    "deadline": "2024-10-01",
    "city": "Ottawa",
    "country": "Canada",
    "link": "https://conf.researchr.org/home/seams-2025",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/6oKWwxrWWLoqZUWz7",
    "note": "SEAMS is a CORE-A ranked conference that applies software engineering methods, techniques, processes, and tools to support the construction of safe, performant, and cost-effective self-adaptive and autonomous systems that provide self-* properties like self-configuration, self-healing, self-optimization, and self-protection. The objective of SEAMS is to bring together researchers and practitioners from academia, industry, and government to investigate, discuss, examine, and advance the fundamental principles, state of the art, and the solutions addressing critical challenges of engineering self-adaptive and self-managing systems."
  },
  {
    "shortName": "ICRA",
    "name": "IEEE International Conference on Robotics and Automation",
    "start": "2025-05-19",
    "end": "2025-05-23",
    "deadline": "2024-09-15",
    "city": "Atlanta",
    "country": "USA",
    "link": "https://2025.ieee-icra.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/2bf9M5y4vR6Js5TNA",
    "note": "The flagship conference of the IEEE Robotics and Automation Society (RAS), ICRA brings together the world’s top researchers and industry leaders to share ideas, exchange knowledge, and advance the field of robotics for the benefit of humanity. With a rapidly changing landscape, it has never been more important to attend this leading industry event."
  },
  {
    "shortName": "IAS",
    "name": "Intelligent Autonomous Systems",
    "start": "2025-06-30",
    "end": "2025-07-04",
    "deadline": "2025-02-15",
    "city": "Genova",
    "country": "Italy",
    "link": "http://ias-19.org/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "AIM",
    "name": "IEEE/ASME International Conference on Advanced Intelligent Mechatronics",
    "start": "2025-07-14",
    "end": "2025-07-18",
    "deadline": "2025-02-01",
    "city": "Hangzhou",
    "country": "China",
    "link": "http://aim2025.org/",
    "type": "Conference",
    "addressLink": "",
    "note": "The 2025 IEEE/ASME International Conference on Advanced Intelligent Mechatronics (AIM2025) is set to be held on July 14-18, 2025 in Hangzhou, China, a city famous for its enchanting West Lake, vibrant tech environment, and rich cultural heritage. Serving as a leading conference in the field of intelligent mechatronic systems, AIM 2025 is committed to advancing diversity in the technology industry, promoting a culture of inclusion and equity, and welcoming, engaging, and rewarding all who contribute to the field and will bring together experts and researchers from around the world to exchange views on cutting-edge research outcomes and future developments."
  },
  {
    "shortName": "ERAS",
    "name": "IEEE Engineering Reliable Autonomous Systems",
    "start": "2025-05-29",
    "end": "2025-05-30",
    "deadline": "2025-01-30",
    "city": "Worcester",
    "country": "USA",
    "link": "http://erasrobotics.org/",
    "type": "Conference",
    "addressLink": "https://maps.app.goo.gl/fs8Bc7rrAHznH2Xj8",
    "note": "A space for all stakeholders across autonomous system reliability to come togther to discuss the key remaining problems and present progress made towards solving them."
  },
  {
    "shortName": "CASE",
    "name": "IEEE International Conference on Automation Science and Engineering",
    "start": "2025-08-18",
    "end": "2025-08-22",
    "deadline": "",
    "city": "Anaheim, CA",
    "country": "USA",
    "link": "",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  },
  {
    "shortName": "IROS",
    "name": "IEEE/RSJ International Conference on Intelligent Robots and Systems",
    "start": "2025-10-19",
    "end": "2025-10-25",
    "deadline": "",
    "city": "Hangzhou",
    "country": "China",
    "link": "https://irmv.sjtu.edu.cn/iros2025/",
    "type": "Conference",
    "addressLink": "",
    "note": ""
  }
]