[
  {
    "name": " Social Robotics, Artificial Intelligence & Multimedia Winter School",
    "deadline": "",
    "city": "Grenoble",
    "country": "France",
    "link": "https://spring-h2020.eu/soraim/",
    "type": "School",
    "shortName": "SoRAIM",
    "start": "2024-02-19",
    "end": "2024-02-23",
    "cost": "free",
    "costNote": "", 
    "addressLink": "https://maps.app.goo.gl/5kz6BJdDRhCbRigZ7",
    "note": "The SoRAIM multi-disciplinary winter school combines topics in social robotics, artificial intelligence, and multimedia. Several top-level invited speakers will introduce and discuss all relevant areas for building socially aware robots that communicate and interact with humans in a shared space."
  },
  {
    "name": "Machine Learning Summer School",
    "deadline": "2024-09-30",
    "city": "Ginowan",
    "country": "Japan",
    "link": "https://groups.oist.jp/mlss",
    "type": "School",
    "shortName": "MLSS",
    "start": "2024-03-04",
    "end": "2024-03-15",
    "cost": "JPY50000-150000",
    "costNote": "students/academics/professional : JPY50000/100000/150000", 
    "addressLink": "https://goo.gl/maps/hZEUAq2dqm8LkVMd7",
    "note": "The machine learning summer school (MLSS) series was started in 2002 with the motivation to promulgate modern methods of statistical machine learning and inference. It was motivated by the observation that while many students are keen to learn about machine learning, and an increasing number of researchers want to apply machine learning methods to their research problems, only few machine learning courses are taught at universities. Machine learning summer schools present topics which are at the core of modern Machine Learning, from fundamentals to state-of-the-art practice. The speakers are leading experts in their field who talk with enthusiasm about their subjects."
  },
  {
    "shortName": "ACDL",
    "name": "Advanced Course on Data Science & Machine Learning",
    "deadline": "2024-02-23",
    "city": "Castiglione della Pescaia",
    "country": "Italy",
    "link": "https://acdl2024.icas.events/",
    "type": "School",
    "start": "2024-06-10",
    "end": "2024-06-14",
    "cost": "€580-630",
    "costNote": "early:580€, late:630€", 
    "addressLink": "https://maps.app.goo.gl/SgTWWKTTyStMvpZM7",
    "note": "The Course provides a stimulating environment for junior academics, early career researches, Post-Docs, PhD students and industry leaders (and highly motivated, promising and brilliant Master students). Participants will also have the chance to present their results with talks, and to interact with their colleagues, in a convivial, professional and productive environment."
  },
  {
    "name": "IEEE RAS Summer School on Multi-robot systems",
    "deadline": "",
    "city": "Prague",
    "country": "Czech Republic",
    "link": "https://mrs.felk.cvut.cz/summer-school-2024/",
    "type": "School",
    "shortName": "RASPRAGUE",
    "start": "2024-07-29",
    "end": "2024-08-02",
    "cost": "€598,95 - €883,30",
    "costNote": "students/academics/professional early(late) : €598,95(665,50)/686,07(762,30)/794,97(883,30)", 
    "addressLink": "https://maps.app.goo.gl/oWsHhXuNhXr7Do5y9",
    "note": "Following the great success of Summer Schools in 2019, 2020, 2022 and 2023, we are now announcing the IEEE RAS Summer School 2024 to be held on July 29 - August 2, 2024. As in the past years, the 2024 IEEE RAS Summer School on Multi-Robot Systems will be held at the campus of Czech Technical University, located at the heart of the beautiful and historic city of Prague. The Summer School will promote the newest achievements in Multi-Robot Systems research to students, academic researchers, and industrial practitioners to enable putting systems of cooperating robots into practice and to encourage networking. The main scope of the 2024 IEEE RAS Summer School on Multi-Robot Systems will be lectures by well-recognized experts in the field, and hands-on experience with real-world experiments using state-of-the-art aerial platforms developed for Multi-Robot research."
  },
]
