[
    {
        "shortName": "EECI-IGS",
        "name": "EECI-IGS various summer schools",
        "start": "2025-01-01",
        "end": "2025-07-07",
        "deadline": "",
        "city": "various",
        "country": "EU",
        "link": "http://www.eeci-igsc.eu/",
        "type": "School",
        "cost": "€350-€800",
        "costNote": "academics/industrial early(late) : €350(450)/€600(800). 150€ low education priority countries", 
        "addressLink": "",
        "note": "Check website, schools are many and different"
    },
    {
        "shortName": "RVSS",
        "name": "Robotic Vision Summer School",
        "start": "2025-02-03",
        "end": "2025-02-08",
        "deadline": "2025-01-15",
        "city": "Kioloa",
        "country": "Australia",
        "link": "https://www.rvss.org.au/",
        "type": "School",
        "cost": "$990-$4500",
        "costNote": "students/industry: AUD 990/4500", 
        "addressLink": "https://maps.app.goo.gl/Zeq8NhEoAVM2jXHL6",
        "note": "The Australian Centre for Robotic Vision presents the Robotic Vision Summer School (RVSS), hosted in-person at the Australian National University (ANU) Kioloa coastal campus. The ability to see is the remaining technological roadblock to the ubiquitous deployment of robots into society. RVSS provides a premium venue for graduate students and industry researchers to learn about fundamental and advanced topics in computer vision and robotics. The summer school also provides a unique opportunity to experiment with computer vision algorithms on actual robotic hardware."
    },
    {
        "shortName": "INVICTA",
        "name": "INVICTA Summer School",
        "start": "2025-04-07",
        "end": "2025-04-11",
        "deadline": "2025-03-24",
        "city": "Porto",
        "country": "Portugal",
        "link": "https://invicta.inesctec.pt/",
        "type": "School",
        "cost": "€650-€750",
        "costNote": "early/regular/late : €650/700/750", 
        "addressLink": "https://maps.app.goo.gl/scrGbsSxrSLViCnEA",
        "note": "The INvicta school of VIsion, Computational intelligence, and patTern Analysis - INVICTA - is a school of artificial intelligence, computer vision and pattern analysis organised by the Visual Computing and Machine Intelligence - VCMI - group of the Centre for Telecommunications and Multimedia - CTM - of the INESC TEC. INVICTA will guide you through an unforgettable journey into the development of intelligent systems, where innovation meets tradition in the captivating city of Porto."
    },
    {
        "shortName": "NENGO",
        "name": "Nengo Summer School",
        "start": "2025-06-01",
        "end": "2025-06-13",
        "deadline": "2025-02-15",
        "city": "Ontario",
        "country": "Canada",
        "link": "https://www.nengo.ai/summer-school/",
        "type": "School",
        "cost": "$550-1000",
        "costNote": "academic/industry: $550/1000", 
        "addressLink": "https://maps.app.goo.gl/fazAfFEXPhkNWzjh7",
        "note": "The Centre for Theoretical Neuroscience at the University of Waterloo is excited to announce our 10th annual Nengo summer school on large-scale brain modelling and neuromorphic computing. As a recurring special feature of the school, participants will be given on-site access to neuromorphic hardware, including Stanford’s mixed digital/analog chip Braindrop, the SpiNNaker chip, and a variety of FPGAs."
    },
    {
        "shortName": "UKROB",
        "name": "UK Robotics Summer Schoo",
        "start": "2025-06-02",
        "end": "2025-06-06",
        "deadline": "2025-02-15",
        "city": "Edimburgh",
        "country": "UK",
        "link": "https://ukrss.site.hw.ac.uk/",
        "type": "School",
        "cost": "£300-600",
        "costNote": "academic/industry: £300/600", 
        "addressLink": "https://maps.app.goo.gl/DMcXJG8nfAG1BaVW6",
        "note": "This is a 5 day Summer School from June 2-6 2025, aimed at developing learning, engagement and knowledge exchange within the field of robotics. This school will offer a combination of lectures, tutorials, and industry presentations, focusing on cutting-edge topics in robotics."
    },
    {
        "shortName": "ETHRSS",
        "name": "ETH Robotics Summer School",
        "start": "2025-06-21",
        "end": "2025-06-27",
        "deadline": "2025-03-21",
        "city": "Geneva",
        "country": "Switzerland",
        "link": "https://robotics-summerschool.ethz.ch/",
        "type": "School",
        "cost": "CHF 200",
        "costNote": "meals and accomodation inc.", 
        "addressLink": "https://maps.app.goo.gl/LfPBMdLzvnUWztNUA",
        "note": "Robotics has become one of the biggest fields of education and research worldwide. The RobotX initiative at ETH Zurich is committed to provide continued education and training to the young generations of researchers and practitioners. This summer school offers lectures and hands-on tutorials to grasp the fundamental concepts that every roboticist around the world should possess."
    },
    {
        "shortName": "AICET",
        "name": "AIDA AI/ML cutting edge trends Symposium and Summer School",
        "start": "2025-07-14",
        "end": "2025-07-18",
        "deadline": "",
        "city": "Thessaloniki",
        "country": "Greece",
        "link": "https://icarus.csd.auth.gr/aida-auth-ai-cutting-edge-trends-aicet2025-summer-symposium-and-school/",
        "type": "School",
        "cost": "€290-490",
        "costNote": "AIDA/Students/Full €290/340/490",
        "addressLink": "https://maps.app.goo.gl/bDvfTAtAgLDa4yxd8",
        "note": "Artificial Intelligence (AI), and Machine Learning (ML) in particular, advance very rapidly, at a pace that even specialists have difficulties in following it. Its impact, particularly through Large Language Models and Generative AI affect almost all scientific disciplines. AI has a huge social impact, e.g., on education, labor market, politics and governance. Given the fast AI evolution, both industry and academia are interested in fast personnel reskilling and upskilling on AI edge technologies. This event, co-organized by International AI Doctoral Academy (AIDA) and Aristotle University of Thessaloniki (AUTH),  will cater these advanced AI education needs."
    },
    {
        "shortName": "CCAA",
        "name": "IEEE RAS Summer School on Cooperative Connected and Autonomous Agents",
        "start": "2025-07-21",
        "end": "2025-07-25",
        "deadline": "2025-03-31",
        "city": "Bari",
        "country": "Italy",
        "link": "https://summer-school-ieeeras2025.poliba.it/about/",
        "type": "School",
        "cost": "€400-800",
        "costNote": "students/academics/professional early(late) : €450(550)/550(650)/700(800)", 
        "addressLink": "https://maps.app.goo.gl/AkxbX1ERcJUkk7VY9",
        "note": "The school will be held at the Polytechnic University of Bari, utilizing the equipment available in the laboratory of the Department of Electrical and Information Engineering the Polytechnic. The school will offer a well-balance blend of theory and practice. The attendees will be introduced to the necessary control and system theory, but also to software tools required to implement control, management policies, diagnosis strategies, and simulation approaches for validating and verifying the proposed techniques. For the practical applications and simulations, the school will employ the equipment and software available in the laboratories of the Department of Electrical and Information Engineering of the Polytechnic."
    },
    {
        "name": "IEEE RAS Summer School on Multi-robot systems",
        "deadline": "",
        "city": "Prague",
        "country": "Czech Republic",
        "link": "https://mrs.fel.cvut.cz/summer-school-2025/",
        "type": "School",
        "shortName": "RASPRAGUE",
        "start": "2025-07-30",
        "end": "2025-08-05",
        "cost": "€598,95 - €883,30",
        "costNote": "students/academics/professional early(late) : €598,95(665,50)/686,07(762,30)/794,97(883,30)", 
        "addressLink": "https://maps.app.goo.gl/oWsHhXuNhXr7Do5y9",
        "note": "Following the great success of our previous Summer Schools in 2019, 2020, 2022, 2023 and 2024, we are excited to announce the IEEE RAS Summer School 2025 that will take place on July 30 - August 5, 2025. As in past years, the 2025 IEEE RAS Summer School on Multi-Robot Systems will be held at the campus of Czech Technical University, located in the heart of the beautiful and historic city of Prague. The Summer School aims to promote the latest achievements in Multi-Robot Systems research, targeting students, academic researchers, and industrial practitioners. Our goal is to enable practical application of systems of cooperating robots and to encourage networking among participants. The main focus of the 2025 IEEE RAS Summer School on Multi-Robot Systems includes lectures by well-recognized experts in the field, and hands-on experience which will enable you to engage in real-world experiments using state-of-the-art aerial platforms developed specifically for Multi-Robot research. Join us at the Czech Technical University in Prague to advance your knowledge, share experiences, and explore the cutting-edge developments in Multi-Robot Systems. Stay tuned for further details!"
    },
    {
        "name": "Summer School to Enable Walking Robots for Domestic Environments",
        "deadline": "2025-03-31",
        "city": "Karlsruhe",
        "country": "Germany",
        "link": "https://www.roboter-im-alltag.org/aktuelles/summer-school-engl/",
        "type": "School",
        "shortName": "RimA",
        "start": "2025-08-11",
        "end": "2025-08-15",
        "cost": "free",
        "costNote": "travel accomodation not included", 
        "addressLink": "https://maps.app.goo.gl/LcDVz47sds64UaDx5",
        "note": "The FZI Research Center for Information Technology, in cooperation with Karlsruhe Institute of Technology, will organize a summer school to enable walking robots for domestic environments using 3D mapping, semantics, ML, ROS 2, and behavior trees for unknown and dynamic environments."
    },
    {
        "shortName": "EEML",
        "name": "Eastern European Machine Learning Summer School",
        "start": "2025-07-21",
        "end": "2025-07-26",
        "deadline": "2025-03-31",
        "city": "Sarajevo",
        "country": "Bosnia And Herzegovina",
        "link": "https://www.eeml.eu/",
        "type": "School",
        "cost": "€100-400",
        "costNote": "students/postdocs/industry: €100/150/400", 
        "addressLink": "",
        "note": ""
    },
    {
        "shortName": "M2L",
        "name": "Mediterranean Machine Learning summer school",
        "start": "2025-09-08",
        "end": "2025-09-12",
        "deadline": "",
        "city": "Split",
        "country": "Croatia",
        "link": "https://www.m2lschool.org/",
        "type": "School",
        "cost": "TBD",
        "costNote": "", 
        "addressLink": "",
        "note": "The 2025 Mediterranean Machine Learning (M2L) summer school will be structured around 5 days of keynotes, lectures and practical sessions. The program will include social or cultural activities to foster networking. Participants will be encouraged to (optionally) present their work at poster sessions during the school and to interact with our sponsors and with each other during the coffee breaks throughout the week."
    },
    {
        "shortName": "SIMERO",
        "name": "Summer School on Singularities of Mechanisms and Robotic Manipulators",
        "start": "2025-09-15",
        "end": "2025-09-19",
        "deadline": "",
        "city": "Barcelona",
        "country": "Spain",
        "link": "https://www.simero.org/",
        "type": "School",
        "cost": "€425-525",
        "costNote": "IFToMM/not early(late) €425(475)/475(525)", 
        "addressLink": "https://maps.app.goo.gl/chTi8yGzhoj4D3tG8",
        "note": "The school will offer a good balance of theory and practice. The attendees will be introduced to the mathematical theory needed to cope with singularities, but also to the software tools to compute and visualize them."
    }
]
